MikroElektronika/core_packages/PIC/XC8/def/PIC16F1615/mcu.h
// Register: PIE4
#define PIE4 PIE4
extern volatile unsigned char           PIE4                __at(0x093);
#ifndef _LIB_BUILD
asm("PIE4 equ 093h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1IE                 :1;
        unsigned SMT1PRAIE              :1;
        unsigned SMT1PWAIE              :1;
        unsigned SMT2IE                 :1;
        unsigned SMT2PRAIE              :1;
        unsigned SMT2PWAIE              :1;
        unsigned CRCIE                  :1;
        unsigned SCANIE                 :1;
    };
} PIE4bits_t;
extern volatile PIE4bits_t PIE4bits __at(0x093);
// bitfield macros
#define _PIE4_SMT1IE_POSN                                   0x0
#define _PIE4_SMT1IE_POSITION                               0x0
#define _PIE4_SMT1IE_SIZE                                   0x1
#define _PIE4_SMT1IE_LENGTH                                 0x1
#define _PIE4_SMT1IE_MASK                                   0x1
#define _PIE4_SMT1PRAIE_POSN                                0x1
#define _PIE4_SMT1PRAIE_POSITION                            0x1
#define _PIE4_SMT1PRAIE_SIZE                                0x1
#define _PIE4_SMT1PRAIE_LENGTH                              0x1
#define _PIE4_SMT1PRAIE_MASK                                0x2
#define _PIE4_SMT1PWAIE_POSN                                0x2
#define _PIE4_SMT1PWAIE_POSITION                            0x2
#define _PIE4_SMT1PWAIE_SIZE                                0x1
#define _PIE4_SMT1PWAIE_LENGTH                              0x1
#define _PIE4_SMT1PWAIE_MASK                                0x4
#define _PIE4_SMT2IE_POSN                                   0x3
#define _PIE4_SMT2IE_POSITION                               0x3
#define _PIE4_SMT2IE_SIZE                                   0x1
#define _PIE4_SMT2IE_LENGTH                                 0x1
#define _PIE4_SMT2IE_MASK                                   0x8
#define _PIE4_SMT2PRAIE_POSN                                0x4
#define _PIE4_SMT2PRAIE_POSITION                            0x4
#define _PIE4_SMT2PRAIE_SIZE                                0x1
#define _PIE4_SMT2PRAIE_LENGTH                              0x1
#define _PIE4_SMT2PRAIE_MASK                                0x10
#define _PIE4_SMT2PWAIE_POSN                                0x5
#define _PIE4_SMT2PWAIE_POSITION                            0x5
#define _PIE4_SMT2PWAIE_SIZE                                0x1
#define _PIE4_SMT2PWAIE_LENGTH                              0x1
#define _PIE4_SMT2PWAIE_MASK                                0x20
#define _PIE4_CRCIE_POSN                                    0x6
#define _PIE4_CRCIE_POSITION                                0x6
#define _PIE4_CRCIE_SIZE                                    0x1
#define _PIE4_CRCIE_LENGTH                                  0x1
#define _PIE4_CRCIE_MASK                                    0x40
#define _PIE4_SCANIE_POSN                                   0x7
#define _PIE4_SCANIE_POSITION                               0x7
#define _PIE4_SCANIE_SIZE                                   0x1
#define _PIE4_SCANIE_LENGTH                                 0x1
#define _PIE4_SCANIE_MASK                                   0x80

// Register: PIE5
#define PIE5 PIE5
extern volatile unsigned char           PIE5                __at(0x094);
#ifndef _LIB_BUILD
asm("PIE5 equ 094h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1DIE                :1;
        unsigned PID1EIE                :1;
        unsigned AT1IE                  :1;
        unsigned                        :1;
        unsigned TMR5IE                 :1;
        unsigned TMR5GIE                :1;
        unsigned TMR3IE                 :1;
        unsigned TMR3GIE                :1;
    };
} PIE5bits_t;
extern volatile PIE5bits_t PIE5bits __at(0x094);
// bitfield macros
#define _PIE5_PID1DIE_POSN                                  0x0
#define _PIE5_PID1DIE_POSITION                              0x0
#define _PIE5_PID1DIE_SIZE                                  0x1
#define _PIE5_PID1DIE_LENGTH                                0x1
#define _PIE5_PID1DIE_MASK                                  0x1
#define _PIE5_PID1EIE_POSN                                  0x1
#define _PIE5_PID1EIE_POSITION                              0x1
#define _PIE5_PID1EIE_SIZE                                  0x1
#define _PIE5_PID1EIE_LENGTH                                0x1
#define _PIE5_PID1EIE_MASK                                  0x2
#define _PIE5_AT1IE_POSN                                    0x2
#define _PIE5_AT1IE_POSITION                                0x2
#define _PIE5_AT1IE_SIZE                                    0x1
#define _PIE5_AT1IE_LENGTH                                  0x1
#define _PIE5_AT1IE_MASK                                    0x4
#define _PIE5_TMR5IE_POSN                                   0x4
#define _PIE5_TMR5IE_POSITION                               0x4
#define _PIE5_TMR5IE_SIZE                                   0x1
#define _PIE5_TMR5IE_LENGTH                                 0x1
#define _PIE5_TMR5IE_MASK                                   0x10
#define _PIE5_TMR5GIE_POSN                                  0x5
#define _PIE5_TMR5GIE_POSITION                              0x5
#define _PIE5_TMR5GIE_SIZE                                  0x1
#define _PIE5_TMR5GIE_LENGTH                                0x1
#define _PIE5_TMR5GIE_MASK                                  0x20
#define _PIE5_TMR3IE_POSN                                   0x6
#define _PIE5_TMR3IE_POSITION                               0x6
#define _PIE5_TMR3IE_SIZE                                   0x1
#define _PIE5_TMR3IE_LENGTH                                 0x1
#define _PIE5_TMR3IE_MASK                                   0x40
#define _PIE5_TMR3GIE_POSN                                  0x7
#define _PIE5_TMR3GIE_POSITION                              0x7
#define _PIE5_TMR3GIE_SIZE                                  0x1
#define _PIE5_TMR3GIE_LENGTH                                0x1
#define _PIE5_TMR3GIE_MASK                                  0x80

// Register: OPTION_REG
#define OPTION_REG OPTION_REG
extern volatile unsigned char           OPTION_REG          __at(0x095);
#ifndef _LIB_BUILD
asm("OPTION_REG equ 095h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PS                     :3;
        unsigned PSA                    :1;
        unsigned TMR0SE                 :1;
        unsigned TMR0CS                 :1;
        unsigned INTEDG                 :1;
        unsigned nWPUEN                 :1;
    };
    struct {
        unsigned _PS0                    :1;  // Note: Changed by MikroE
        unsigned _PS1                    :1;  // Note: Changed by MikroE
        unsigned _PS2                    :1;  // Note: Changed by MikroE
        unsigned                        :1;
        unsigned T0SE                   :1;
        unsigned T0CS                   :1;
    };
} OPTION_REGbits_t;
extern volatile OPTION_REGbits_t OPTION_REGbits __at(0x095);
// bitfield macros
#define _OPTION_REG_PS_POSN                                 0x0
#define _OPTION_REG_PS_POSITION                             0x0
#define _OPTION_REG_PS_SIZE                                 0x3
#define _OPTION_REG_PS_LENGTH                               0x3
#define _OPTION_REG_PS_MASK                                 0x7
#define _OPTION_REG_PSA_POSN                                0x3
#define _OPTION_REG_PSA_POSITION                            0x3
#define _OPTION_REG_PSA_SIZE                                0x1
#define _OPTION_REG_PSA_LENGTH                              0x1
#define _OPTION_REG_PSA_MASK                                0x8
#define _OPTION_REG_TMR0SE_POSN                             0x4
#define _OPTION_REG_TMR0SE_POSITION                         0x4
#define _OPTION_REG_TMR0SE_SIZE                             0x1
#define _OPTION_REG_TMR0SE_LENGTH                           0x1
#define _OPTION_REG_TMR0SE_MASK                             0x10
#define _OPTION_REG_TMR0CS_POSN                             0x5
#define _OPTION_REG_TMR0CS_POSITION                         0x5
#define _OPTION_REG_TMR0CS_SIZE                             0x1
#define _OPTION_REG_TMR0CS_LENGTH                           0x1
#define _OPTION_REG_TMR0CS_MASK                             0x20
#define _OPTION_REG_INTEDG_POSN                             0x6
#define _OPTION_REG_INTEDG_POSITION                         0x6
#define _OPTION_REG_INTEDG_SIZE                             0x1
#define _OPTION_REG_INTEDG_LENGTH                           0x1
#define _OPTION_REG_INTEDG_MASK                             0x40
#define _OPTION_REG_nWPUEN_POSN                             0x7
#define _OPTION_REG_nWPUEN_POSITION                         0x7
#define _OPTION_REG_nWPUEN_SIZE                             0x1
#define _OPTION_REG_nWPUEN_LENGTH                           0x1
#define _OPTION_REG_nWPUEN_MASK                             0x80
#define _OPTION_REG_PS0_POSN                                0x0
#define _OPTION_REG_PS0_POSITION                            0x0
#define _OPTION_REG_PS0_SIZE                                0x1
#define _OPTION_REG_PS0_LENGTH                              0x1
#define _OPTION_REG_PS0_MASK                                0x1
#define _OPTION_REG_PS1_POSN                                0x1
#define _OPTION_REG_PS1_POSITION                            0x1
#define _OPTION_REG_PS1_SIZE                                0x1
#define _OPTION_REG_PS1_LENGTH                              0x1
#define _OPTION_REG_PS1_MASK                                0x2
#define _OPTION_REG_PS2_POSN                                0x2
#define _OPTION_REG_PS2_POSITION                            0x2
#define _OPTION_REG_PS2_SIZE                                0x1
#define _OPTION_REG_PS2_LENGTH                              0x1
#define _OPTION_REG_PS2_MASK                                0x4
#define _OPTION_REG_T0SE_POSN                               0x4
#define _OPTION_REG_T0SE_POSITION                           0x4
#define _OPTION_REG_T0SE_SIZE                               0x1
#define _OPTION_REG_T0SE_LENGTH                             0x1
#define _OPTION_REG_T0SE_MASK                               0x10
#define _OPTION_REG_T0CS_POSN                               0x5
#define _OPTION_REG_T0CS_POSITION                           0x5
#define _OPTION_REG_T0CS_SIZE                               0x1
#define _OPTION_REG_T0CS_LENGTH                             0x1
#define _OPTION_REG_T0CS_MASK                               0x20

// Register: PCON
#define PCON PCON
extern volatile unsigned char           PCON                __at(0x096);
#ifndef _LIB_BUILD
asm("PCON equ 096h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned nBOR                   :1;
        unsigned nPOR                   :1;
        unsigned nRI                    :1;
        unsigned nRMCLR                 :1;
        unsigned nRWDT                  :1;
        unsigned nWDTWV                 :1;
        unsigned STKUNF                 :1;
        unsigned STKOVF                 :1;
    };
} PCONbits_t;
extern volatile PCONbits_t PCONbits __at(0x096);
// bitfield macros
#define _PCON_nBOR_POSN                                     0x0
#define _PCON_nBOR_POSITION                                 0x0
#define _PCON_nBOR_SIZE                                     0x1
#define _PCON_nBOR_LENGTH                                   0x1
#define _PCON_nBOR_MASK                                     0x1
#define _PCON_nPOR_POSN                                     0x1
#define _PCON_nPOR_POSITION                                 0x1
#define _PCON_nPOR_SIZE                                     0x1
#define _PCON_nPOR_LENGTH                                   0x1
#define _PCON_nPOR_MASK                                     0x2
#define _PCON_nRI_POSN                                      0x2
#define _PCON_nRI_POSITION                                  0x2
#define _PCON_nRI_SIZE                                      0x1
#define _PCON_nRI_LENGTH                                    0x1
#define _PCON_nRI_MASK                                      0x4
#define _PCON_nRMCLR_POSN                                   0x3
#define _PCON_nRMCLR_POSITION                               0x3
#define _PCON_nRMCLR_SIZE                                   0x1
#define _PCON_nRMCLR_LENGTH                                 0x1
#define _PCON_nRMCLR_MASK                                   0x8
#define _PCON_nRWDT_POSN                                    0x4
#define _PCON_nRWDT_POSITION                                0x4
#define _PCON_nRWDT_SIZE                                    0x1
#define _PCON_nRWDT_LENGTH                                  0x1
#define _PCON_nRWDT_MASK                                    0x10
#define _PCON_nWDTWV_POSN                                   0x5
#define _PCON_nWDTWV_POSITION                               0x5
#define _PCON_nWDTWV_SIZE                                   0x1
#define _PCON_nWDTWV_LENGTH                                 0x1
#define _PCON_nWDTWV_MASK                                   0x20
#define _PCON_STKUNF_POSN                                   0x6
#define _PCON_STKUNF_POSITION                               0x6
#define _PCON_STKUNF_SIZE                                   0x1
#define _PCON_STKUNF_LENGTH                                 0x1
#define _PCON_STKUNF_MASK                                   0x40
#define _PCON_STKOVF_POSN                                   0x7
#define _PCON_STKOVF_POSITION                               0x7
#define _PCON_STKOVF_SIZE                                   0x1
#define _PCON_STKOVF_LENGTH                                 0x1
#define _PCON_STKOVF_MASK                                   0x80

