MikroElektronika/core_packages/PIC/XC8/def/PIC16F1615/mcu.h
extern volatile PID1K1Lbits_t PID1K1Lbits __at(0x590);
// bitfield macros
#define _PID1K1L_PID1K10_POSN                               0x0
#define _PID1K1L_PID1K10_POSITION                           0x0
#define _PID1K1L_PID1K10_SIZE                               0x1
#define _PID1K1L_PID1K10_LENGTH                             0x1
#define _PID1K1L_PID1K10_MASK                               0x1
#define _PID1K1L_PID1K11_POSN                               0x1
#define _PID1K1L_PID1K11_POSITION                           0x1
#define _PID1K1L_PID1K11_SIZE                               0x1
#define _PID1K1L_PID1K11_LENGTH                             0x1
#define _PID1K1L_PID1K11_MASK                               0x2
#define _PID1K1L_PID1K12_POSN                               0x2
#define _PID1K1L_PID1K12_POSITION                           0x2
#define _PID1K1L_PID1K12_SIZE                               0x1
#define _PID1K1L_PID1K12_LENGTH                             0x1
#define _PID1K1L_PID1K12_MASK                               0x4
#define _PID1K1L_PID1K13_POSN                               0x3
#define _PID1K1L_PID1K13_POSITION                           0x3
#define _PID1K1L_PID1K13_SIZE                               0x1
#define _PID1K1L_PID1K13_LENGTH                             0x1
#define _PID1K1L_PID1K13_MASK                               0x8
#define _PID1K1L_PID1K14_POSN                               0x4
#define _PID1K1L_PID1K14_POSITION                           0x4
#define _PID1K1L_PID1K14_SIZE                               0x1
#define _PID1K1L_PID1K14_LENGTH                             0x1
#define _PID1K1L_PID1K14_MASK                               0x10
#define _PID1K1L_PID1K15_POSN                               0x5
#define _PID1K1L_PID1K15_POSITION                           0x5
#define _PID1K1L_PID1K15_SIZE                               0x1
#define _PID1K1L_PID1K15_LENGTH                             0x1
#define _PID1K1L_PID1K15_MASK                               0x20
#define _PID1K1L_PID1K16_POSN                               0x6
#define _PID1K1L_PID1K16_POSITION                           0x6
#define _PID1K1L_PID1K16_SIZE                               0x1
#define _PID1K1L_PID1K16_LENGTH                             0x1
#define _PID1K1L_PID1K16_MASK                               0x40
#define _PID1K1L_PID1K17_POSN                               0x7
#define _PID1K1L_PID1K17_POSITION                           0x7
#define _PID1K1L_PID1K17_SIZE                               0x1
#define _PID1K1L_PID1K17_LENGTH                             0x1
#define _PID1K1L_PID1K17_MASK                               0x80
#define _PID1K1L_K10_POSN                                   0x0
#define _PID1K1L_K10_POSITION                               0x0
#define _PID1K1L_K10_SIZE                                   0x1
#define _PID1K1L_K10_LENGTH                                 0x1
#define _PID1K1L_K10_MASK                                   0x1
#define _PID1K1L_K11_POSN                                   0x1
#define _PID1K1L_K11_POSITION                               0x1
#define _PID1K1L_K11_SIZE                                   0x1
#define _PID1K1L_K11_LENGTH                                 0x1
#define _PID1K1L_K11_MASK                                   0x2
#define _PID1K1L_K12_POSN                                   0x2
#define _PID1K1L_K12_POSITION                               0x2
#define _PID1K1L_K12_SIZE                                   0x1
#define _PID1K1L_K12_LENGTH                                 0x1
#define _PID1K1L_K12_MASK                                   0x4
#define _PID1K1L_K13_POSN                                   0x3
#define _PID1K1L_K13_POSITION                               0x3
#define _PID1K1L_K13_SIZE                                   0x1
#define _PID1K1L_K13_LENGTH                                 0x1
#define _PID1K1L_K13_MASK                                   0x8
#define _PID1K1L_K14_POSN                                   0x4
#define _PID1K1L_K14_POSITION                               0x4
#define _PID1K1L_K14_SIZE                                   0x1
#define _PID1K1L_K14_LENGTH                                 0x1
#define _PID1K1L_K14_MASK                                   0x10
#define _PID1K1L_K15_POSN                                   0x5
#define _PID1K1L_K15_POSITION                               0x5
#define _PID1K1L_K15_SIZE                                   0x1
#define _PID1K1L_K15_LENGTH                                 0x1
#define _PID1K1L_K15_MASK                                   0x20
#define _PID1K1L_K16_POSN                                   0x6
#define _PID1K1L_K16_POSITION                               0x6
#define _PID1K1L_K16_SIZE                                   0x1
#define _PID1K1L_K16_LENGTH                                 0x1
#define _PID1K1L_K16_MASK                                   0x40
#define _PID1K1L_K17_POSN                                   0x7
#define _PID1K1L_K17_POSITION                               0x7
#define _PID1K1L_K17_SIZE                                   0x1
#define _PID1K1L_K17_LENGTH                                 0x1
#define _PID1K1L_K17_MASK                                   0x80

// Register: PID1K1H
#define PID1K1H PID1K1H
extern volatile unsigned char           PID1K1H             __at(0x591);
#ifndef _LIB_BUILD
asm("PID1K1H equ 0591h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1K18                :1;
        unsigned PID1K19                :1;
        unsigned PID1K110               :1;
        unsigned PID1K111               :1;
        unsigned PID1K112               :1;
        unsigned PID1K113               :1;
        unsigned PID1K114               :1;
        unsigned PID1K115               :1;
    };
    struct {
        unsigned K18                    :1;
        unsigned K19                    :1;
        unsigned K110                   :1;
        unsigned K111                   :1;
        unsigned K112                   :1;
        unsigned K113                   :1;
        unsigned K114                   :1;
        unsigned K115                   :1;
    };
} PID1K1Hbits_t;
extern volatile PID1K1Hbits_t PID1K1Hbits __at(0x591);
// bitfield macros
#define _PID1K1H_PID1K18_POSN                               0x0
#define _PID1K1H_PID1K18_POSITION                           0x0
#define _PID1K1H_PID1K18_SIZE                               0x1
#define _PID1K1H_PID1K18_LENGTH                             0x1
#define _PID1K1H_PID1K18_MASK                               0x1
#define _PID1K1H_PID1K19_POSN                               0x1
#define _PID1K1H_PID1K19_POSITION                           0x1
#define _PID1K1H_PID1K19_SIZE                               0x1
#define _PID1K1H_PID1K19_LENGTH                             0x1
#define _PID1K1H_PID1K19_MASK                               0x2
#define _PID1K1H_PID1K110_POSN                              0x2
#define _PID1K1H_PID1K110_POSITION                          0x2
#define _PID1K1H_PID1K110_SIZE                              0x1
#define _PID1K1H_PID1K110_LENGTH                            0x1
#define _PID1K1H_PID1K110_MASK                              0x4
#define _PID1K1H_PID1K111_POSN                              0x3
#define _PID1K1H_PID1K111_POSITION                          0x3
#define _PID1K1H_PID1K111_SIZE                              0x1
#define _PID1K1H_PID1K111_LENGTH                            0x1
#define _PID1K1H_PID1K111_MASK                              0x8
#define _PID1K1H_PID1K112_POSN                              0x4
#define _PID1K1H_PID1K112_POSITION                          0x4
#define _PID1K1H_PID1K112_SIZE                              0x1
#define _PID1K1H_PID1K112_LENGTH                            0x1
#define _PID1K1H_PID1K112_MASK                              0x10
#define _PID1K1H_PID1K113_POSN                              0x5
#define _PID1K1H_PID1K113_POSITION                          0x5
#define _PID1K1H_PID1K113_SIZE                              0x1
#define _PID1K1H_PID1K113_LENGTH                            0x1
#define _PID1K1H_PID1K113_MASK                              0x20
#define _PID1K1H_PID1K114_POSN                              0x6
#define _PID1K1H_PID1K114_POSITION                          0x6
#define _PID1K1H_PID1K114_SIZE                              0x1
#define _PID1K1H_PID1K114_LENGTH                            0x1
#define _PID1K1H_PID1K114_MASK                              0x40
#define _PID1K1H_PID1K115_POSN                              0x7
#define _PID1K1H_PID1K115_POSITION                          0x7
#define _PID1K1H_PID1K115_SIZE                              0x1
#define _PID1K1H_PID1K115_LENGTH                            0x1
#define _PID1K1H_PID1K115_MASK                              0x80
#define _PID1K1H_K18_POSN                                   0x0
#define _PID1K1H_K18_POSITION                               0x0
#define _PID1K1H_K18_SIZE                                   0x1
#define _PID1K1H_K18_LENGTH                                 0x1
#define _PID1K1H_K18_MASK                                   0x1
#define _PID1K1H_K19_POSN                                   0x1
#define _PID1K1H_K19_POSITION                               0x1
#define _PID1K1H_K19_SIZE                                   0x1
#define _PID1K1H_K19_LENGTH                                 0x1
#define _PID1K1H_K19_MASK                                   0x2
#define _PID1K1H_K110_POSN                                  0x2
#define _PID1K1H_K110_POSITION                              0x2
#define _PID1K1H_K110_SIZE                                  0x1
#define _PID1K1H_K110_LENGTH                                0x1
#define _PID1K1H_K110_MASK                                  0x4
#define _PID1K1H_K111_POSN                                  0x3
#define _PID1K1H_K111_POSITION                              0x3
#define _PID1K1H_K111_SIZE                                  0x1
#define _PID1K1H_K111_LENGTH                                0x1
#define _PID1K1H_K111_MASK                                  0x8
#define _PID1K1H_K112_POSN                                  0x4
#define _PID1K1H_K112_POSITION                              0x4
#define _PID1K1H_K112_SIZE                                  0x1
#define _PID1K1H_K112_LENGTH                                0x1
#define _PID1K1H_K112_MASK                                  0x10
#define _PID1K1H_K113_POSN                                  0x5
#define _PID1K1H_K113_POSITION                              0x5
#define _PID1K1H_K113_SIZE                                  0x1
#define _PID1K1H_K113_LENGTH                                0x1
#define _PID1K1H_K113_MASK                                  0x20
#define _PID1K1H_K114_POSN                                  0x6
#define _PID1K1H_K114_POSITION                              0x6
#define _PID1K1H_K114_SIZE                                  0x1
#define _PID1K1H_K114_LENGTH                                0x1
#define _PID1K1H_K114_MASK                                  0x40
#define _PID1K1H_K115_POSN                                  0x7
#define _PID1K1H_K115_POSITION                              0x7
#define _PID1K1H_K115_SIZE                                  0x1
#define _PID1K1H_K115_LENGTH                                0x1
#define _PID1K1H_K115_MASK                                  0x80

