MikroElektronika/core_packages/PIC/XC8/def/PIC16F1615/mcu.h
// Register: AT1MISSH
#define AT1MISSH AT1MISSH
extern volatile unsigned char           AT1MISSH            __at(0x80F);
#ifndef _LIB_BUILD
asm("AT1MISSH equ 080Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1MISS8               :1;
        unsigned AT1MISS9               :1;
        unsigned AT1MISS10              :1;
        unsigned AT1MISS11              :1;
        unsigned AT1MISS12              :1;
        unsigned AT1MISS13              :1;
        unsigned AT1MISS14              :1;
        unsigned AT1MISS15              :1;
    };
    struct {
        unsigned MISS8                  :1;
        unsigned MISS9                  :1;
        unsigned MISS10                 :1;
        unsigned MISS11                 :1;
        unsigned MISS12                 :1;
        unsigned MISS13                 :1;
        unsigned MISS14                 :1;
        unsigned MISS15                 :1;
    };
} AT1MISSHbits_t;
extern volatile AT1MISSHbits_t AT1MISSHbits __at(0x80F);
// bitfield macros
#define _AT1MISSH_AT1MISS8_POSN                             0x0
#define _AT1MISSH_AT1MISS8_POSITION                         0x0
#define _AT1MISSH_AT1MISS8_SIZE                             0x1
#define _AT1MISSH_AT1MISS8_LENGTH                           0x1
#define _AT1MISSH_AT1MISS8_MASK                             0x1
#define _AT1MISSH_AT1MISS9_POSN                             0x1
#define _AT1MISSH_AT1MISS9_POSITION                         0x1
#define _AT1MISSH_AT1MISS9_SIZE                             0x1
#define _AT1MISSH_AT1MISS9_LENGTH                           0x1
#define _AT1MISSH_AT1MISS9_MASK                             0x2
#define _AT1MISSH_AT1MISS10_POSN                            0x2
#define _AT1MISSH_AT1MISS10_POSITION                        0x2
#define _AT1MISSH_AT1MISS10_SIZE                            0x1
#define _AT1MISSH_AT1MISS10_LENGTH                          0x1
#define _AT1MISSH_AT1MISS10_MASK                            0x4
#define _AT1MISSH_AT1MISS11_POSN                            0x3
#define _AT1MISSH_AT1MISS11_POSITION                        0x3
#define _AT1MISSH_AT1MISS11_SIZE                            0x1
#define _AT1MISSH_AT1MISS11_LENGTH                          0x1
#define _AT1MISSH_AT1MISS11_MASK                            0x8
#define _AT1MISSH_AT1MISS12_POSN                            0x4
#define _AT1MISSH_AT1MISS12_POSITION                        0x4
#define _AT1MISSH_AT1MISS12_SIZE                            0x1
#define _AT1MISSH_AT1MISS12_LENGTH                          0x1
#define _AT1MISSH_AT1MISS12_MASK                            0x10
#define _AT1MISSH_AT1MISS13_POSN                            0x5
#define _AT1MISSH_AT1MISS13_POSITION                        0x5
#define _AT1MISSH_AT1MISS13_SIZE                            0x1
#define _AT1MISSH_AT1MISS13_LENGTH                          0x1
#define _AT1MISSH_AT1MISS13_MASK                            0x20
#define _AT1MISSH_AT1MISS14_POSN                            0x6
#define _AT1MISSH_AT1MISS14_POSITION                        0x6
#define _AT1MISSH_AT1MISS14_SIZE                            0x1
#define _AT1MISSH_AT1MISS14_LENGTH                          0x1
#define _AT1MISSH_AT1MISS14_MASK                            0x40
#define _AT1MISSH_AT1MISS15_POSN                            0x7
#define _AT1MISSH_AT1MISS15_POSITION                        0x7
#define _AT1MISSH_AT1MISS15_SIZE                            0x1
#define _AT1MISSH_AT1MISS15_LENGTH                          0x1
#define _AT1MISSH_AT1MISS15_MASK                            0x80
#define _AT1MISSH_MISS8_POSN                                0x0
#define _AT1MISSH_MISS8_POSITION                            0x0
#define _AT1MISSH_MISS8_SIZE                                0x1
#define _AT1MISSH_MISS8_LENGTH                              0x1
#define _AT1MISSH_MISS8_MASK                                0x1
#define _AT1MISSH_MISS9_POSN                                0x1
#define _AT1MISSH_MISS9_POSITION                            0x1
#define _AT1MISSH_MISS9_SIZE                                0x1
#define _AT1MISSH_MISS9_LENGTH                              0x1
#define _AT1MISSH_MISS9_MASK                                0x2
#define _AT1MISSH_MISS10_POSN                               0x2
#define _AT1MISSH_MISS10_POSITION                           0x2
#define _AT1MISSH_MISS10_SIZE                               0x1
#define _AT1MISSH_MISS10_LENGTH                             0x1
#define _AT1MISSH_MISS10_MASK                               0x4
#define _AT1MISSH_MISS11_POSN                               0x3
#define _AT1MISSH_MISS11_POSITION                           0x3
#define _AT1MISSH_MISS11_SIZE                               0x1
#define _AT1MISSH_MISS11_LENGTH                             0x1
#define _AT1MISSH_MISS11_MASK                               0x8
#define _AT1MISSH_MISS12_POSN                               0x4
#define _AT1MISSH_MISS12_POSITION                           0x4
#define _AT1MISSH_MISS12_SIZE                               0x1
#define _AT1MISSH_MISS12_LENGTH                             0x1
#define _AT1MISSH_MISS12_MASK                               0x10
#define _AT1MISSH_MISS13_POSN                               0x5
#define _AT1MISSH_MISS13_POSITION                           0x5
#define _AT1MISSH_MISS13_SIZE                               0x1
#define _AT1MISSH_MISS13_LENGTH                             0x1
#define _AT1MISSH_MISS13_MASK                               0x20
#define _AT1MISSH_MISS14_POSN                               0x6
#define _AT1MISSH_MISS14_POSITION                           0x6
#define _AT1MISSH_MISS14_SIZE                               0x1
#define _AT1MISSH_MISS14_LENGTH                             0x1
#define _AT1MISSH_MISS14_MASK                               0x40
#define _AT1MISSH_MISS15_POSN                               0x7
#define _AT1MISSH_MISS15_POSITION                           0x7
#define _AT1MISSH_MISS15_SIZE                               0x1
#define _AT1MISSH_MISS15_LENGTH                             0x1
#define _AT1MISSH_MISS15_MASK                               0x80

// Register: AT1PER
#define AT1PER AT1PER
extern volatile unsigned short          AT1PER              __at(0x810);
#ifndef _LIB_BUILD
asm("AT1PER equ 0810h");
#endif

