MikroElektronika/core_packages/PIC/XC8/def/PIC16F1615/mcu.h
extern volatile AT1IR0bits_t AT1IR0bits __at(0x816);
// bitfield macros
#define _AT1IR0_AT1PERIF_POSN                               0x0
#define _AT1IR0_AT1PERIF_POSITION                           0x0
#define _AT1IR0_AT1PERIF_SIZE                               0x1
#define _AT1IR0_AT1PERIF_LENGTH                             0x1
#define _AT1IR0_AT1PERIF_MASK                               0x1
#define _AT1IR0_AT1MISSIF_POSN                              0x1
#define _AT1IR0_AT1MISSIF_POSITION                          0x1
#define _AT1IR0_AT1MISSIF_SIZE                              0x1
#define _AT1IR0_AT1MISSIF_LENGTH                            0x1
#define _AT1IR0_AT1MISSIF_MASK                              0x2
#define _AT1IR0_AT1PHSIF_POSN                               0x2
#define _AT1IR0_AT1PHSIF_POSITION                           0x2
#define _AT1IR0_AT1PHSIF_SIZE                               0x1
#define _AT1IR0_AT1PHSIF_LENGTH                             0x1
#define _AT1IR0_AT1PHSIF_MASK                               0x4

// Register: AT1IE0
#define AT1IE0 AT1IE0
extern volatile unsigned char           AT1IE0              __at(0x817);
#ifndef _LIB_BUILD
asm("AT1IE0 equ 0817h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1PERIE               :1;
        unsigned AT1MISSIE              :1;
        unsigned AT1PHSIE               :1;
    };
} AT1IE0bits_t;
extern volatile AT1IE0bits_t AT1IE0bits __at(0x817);
// bitfield macros
#define _AT1IE0_AT1PERIE_POSN                               0x0
#define _AT1IE0_AT1PERIE_POSITION                           0x0
#define _AT1IE0_AT1PERIE_SIZE                               0x1
#define _AT1IE0_AT1PERIE_LENGTH                             0x1
#define _AT1IE0_AT1PERIE_MASK                               0x1
#define _AT1IE0_AT1MISSIE_POSN                              0x1
#define _AT1IE0_AT1MISSIE_POSITION                          0x1
#define _AT1IE0_AT1MISSIE_SIZE                              0x1
#define _AT1IE0_AT1MISSIE_LENGTH                            0x1
#define _AT1IE0_AT1MISSIE_MASK                              0x2
#define _AT1IE0_AT1PHSIE_POSN                               0x2
#define _AT1IE0_AT1PHSIE_POSITION                           0x2
#define _AT1IE0_AT1PHSIE_SIZE                               0x1
#define _AT1IE0_AT1PHSIE_LENGTH                             0x1
#define _AT1IE0_AT1PHSIE_MASK                               0x4

// Register: AT1IR1
#define AT1IR1 AT1IR1
extern volatile unsigned char           AT1IR1              __at(0x818);
#ifndef _LIB_BUILD
asm("AT1IR1 equ 0818h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1CC1IF               :1;
        unsigned AT1CC2IF               :1;
        unsigned AT1CC3IF               :1;
    };
} AT1IR1bits_t;
extern volatile AT1IR1bits_t AT1IR1bits __at(0x818);
// bitfield macros
#define _AT1IR1_AT1CC1IF_POSN                               0x0
#define _AT1IR1_AT1CC1IF_POSITION                           0x0
#define _AT1IR1_AT1CC1IF_SIZE                               0x1
#define _AT1IR1_AT1CC1IF_LENGTH                             0x1
#define _AT1IR1_AT1CC1IF_MASK                               0x1
#define _AT1IR1_AT1CC2IF_POSN                               0x1
#define _AT1IR1_AT1CC2IF_POSITION                           0x1
#define _AT1IR1_AT1CC2IF_SIZE                               0x1
#define _AT1IR1_AT1CC2IF_LENGTH                             0x1
#define _AT1IR1_AT1CC2IF_MASK                               0x2
#define _AT1IR1_AT1CC3IF_POSN                               0x2
#define _AT1IR1_AT1CC3IF_POSITION                           0x2
#define _AT1IR1_AT1CC3IF_SIZE                               0x1
#define _AT1IR1_AT1CC3IF_LENGTH                             0x1
#define _AT1IR1_AT1CC3IF_MASK                               0x4

// Register: AT1IE1
#define AT1IE1 AT1IE1
extern volatile unsigned char           AT1IE1              __at(0x819);
#ifndef _LIB_BUILD
asm("AT1IE1 equ 0819h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1CC1IE               :1;
        unsigned AT1CC2IE               :1;
        unsigned AT1CC3IE               :1;
    };
} AT1IE1bits_t;
extern volatile AT1IE1bits_t AT1IE1bits __at(0x819);
// bitfield macros
#define _AT1IE1_AT1CC1IE_POSN                               0x0
#define _AT1IE1_AT1CC1IE_POSITION                           0x0
#define _AT1IE1_AT1CC1IE_SIZE                               0x1
#define _AT1IE1_AT1CC1IE_LENGTH                             0x1
#define _AT1IE1_AT1CC1IE_MASK                               0x1
#define _AT1IE1_AT1CC2IE_POSN                               0x1
#define _AT1IE1_AT1CC2IE_POSITION                           0x1
#define _AT1IE1_AT1CC2IE_SIZE                               0x1
#define _AT1IE1_AT1CC2IE_LENGTH                             0x1
#define _AT1IE1_AT1CC2IE_MASK                               0x2
#define _AT1IE1_AT1CC3IE_POSN                               0x2
#define _AT1IE1_AT1CC3IE_POSITION                           0x2
#define _AT1IE1_AT1CC3IE_SIZE                               0x1
#define _AT1IE1_AT1CC3IE_LENGTH                             0x1
#define _AT1IE1_AT1CC3IE_MASK                               0x4

// Register: AT1STPT
#define AT1STPT AT1STPT
extern volatile unsigned short          AT1STPT             __at(0x81A);
#ifndef _LIB_BUILD
asm("AT1STPT equ 081Ah");
#endif

// Register: AT1STPTL
#define AT1STPTL AT1STPTL
extern volatile unsigned char           AT1STPTL            __at(0x81A);
#ifndef _LIB_BUILD
asm("AT1STPTL equ 081Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1STPT0               :1;
        unsigned AT1STPT1               :1;
        unsigned AT1STPT2               :1;
        unsigned AT1STPT3               :1;
        unsigned AT1STPT4               :1;
        unsigned AT1STPT5               :1;
        unsigned AT1STPT6               :1;
        unsigned AT1STPT7               :1;
    };
    struct {
        unsigned STPT0                  :1;
        unsigned STPT1                  :1;
        unsigned STPT2                  :1;
        unsigned STPT3                  :1;
        unsigned STPT4                  :1;
        unsigned STPT5                  :1;
        unsigned STPT6                  :1;
        unsigned STPT7                  :1;
    };
} AT1STPTLbits_t;
extern volatile AT1STPTLbits_t AT1STPTLbits __at(0x81A);
// bitfield macros
#define _AT1STPTL_AT1STPT0_POSN                             0x0
#define _AT1STPTL_AT1STPT0_POSITION                         0x0
#define _AT1STPTL_AT1STPT0_SIZE                             0x1
#define _AT1STPTL_AT1STPT0_LENGTH                           0x1
#define _AT1STPTL_AT1STPT0_MASK                             0x1
#define _AT1STPTL_AT1STPT1_POSN                             0x1
#define _AT1STPTL_AT1STPT1_POSITION                         0x1
#define _AT1STPTL_AT1STPT1_SIZE                             0x1
#define _AT1STPTL_AT1STPT1_LENGTH                           0x1
#define _AT1STPTL_AT1STPT1_MASK                             0x2
#define _AT1STPTL_AT1STPT2_POSN                             0x2
#define _AT1STPTL_AT1STPT2_POSITION                         0x2
#define _AT1STPTL_AT1STPT2_SIZE                             0x1
#define _AT1STPTL_AT1STPT2_LENGTH                           0x1
#define _AT1STPTL_AT1STPT2_MASK                             0x4
#define _AT1STPTL_AT1STPT3_POSN                             0x3
#define _AT1STPTL_AT1STPT3_POSITION                         0x3
#define _AT1STPTL_AT1STPT3_SIZE                             0x1
#define _AT1STPTL_AT1STPT3_LENGTH                           0x1
#define _AT1STPTL_AT1STPT3_MASK                             0x8
#define _AT1STPTL_AT1STPT4_POSN                             0x4
#define _AT1STPTL_AT1STPT4_POSITION                         0x4
#define _AT1STPTL_AT1STPT4_SIZE                             0x1
#define _AT1STPTL_AT1STPT4_LENGTH                           0x1
#define _AT1STPTL_AT1STPT4_MASK                             0x10
#define _AT1STPTL_AT1STPT5_POSN                             0x5
#define _AT1STPTL_AT1STPT5_POSITION                         0x5
#define _AT1STPTL_AT1STPT5_SIZE                             0x1
#define _AT1STPTL_AT1STPT5_LENGTH                           0x1
#define _AT1STPTL_AT1STPT5_MASK                             0x20
#define _AT1STPTL_AT1STPT6_POSN                             0x6
#define _AT1STPTL_AT1STPT6_POSITION                         0x6
#define _AT1STPTL_AT1STPT6_SIZE                             0x1
#define _AT1STPTL_AT1STPT6_LENGTH                           0x1
#define _AT1STPTL_AT1STPT6_MASK                             0x40
#define _AT1STPTL_AT1STPT7_POSN                             0x7
#define _AT1STPTL_AT1STPT7_POSITION                         0x7
#define _AT1STPTL_AT1STPT7_SIZE                             0x1
#define _AT1STPTL_AT1STPT7_LENGTH                           0x1
#define _AT1STPTL_AT1STPT7_MASK                             0x80
#define _AT1STPTL_STPT0_POSN                                0x0
#define _AT1STPTL_STPT0_POSITION                            0x0
#define _AT1STPTL_STPT0_SIZE                                0x1
#define _AT1STPTL_STPT0_LENGTH                              0x1
#define _AT1STPTL_STPT0_MASK                                0x1
#define _AT1STPTL_STPT1_POSN                                0x1
#define _AT1STPTL_STPT1_POSITION                            0x1
#define _AT1STPTL_STPT1_SIZE                                0x1
#define _AT1STPTL_STPT1_LENGTH                              0x1
#define _AT1STPTL_STPT1_MASK                                0x2
#define _AT1STPTL_STPT2_POSN                                0x2
#define _AT1STPTL_STPT2_POSITION                            0x2
#define _AT1STPTL_STPT2_SIZE                                0x1
#define _AT1STPTL_STPT2_LENGTH                              0x1
#define _AT1STPTL_STPT2_MASK                                0x4
#define _AT1STPTL_STPT3_POSN                                0x3
#define _AT1STPTL_STPT3_POSITION                            0x3
#define _AT1STPTL_STPT3_SIZE                                0x1
#define _AT1STPTL_STPT3_LENGTH                              0x1
#define _AT1STPTL_STPT3_MASK                                0x8
#define _AT1STPTL_STPT4_POSN                                0x4
#define _AT1STPTL_STPT4_POSITION                            0x4
#define _AT1STPTL_STPT4_SIZE                                0x1
#define _AT1STPTL_STPT4_LENGTH                              0x1
#define _AT1STPTL_STPT4_MASK                                0x10
#define _AT1STPTL_STPT5_POSN                                0x5
#define _AT1STPTL_STPT5_POSITION                            0x5
#define _AT1STPTL_STPT5_SIZE                                0x1
#define _AT1STPTL_STPT5_LENGTH                              0x1
#define _AT1STPTL_STPT5_MASK                                0x20
#define _AT1STPTL_STPT6_POSN                                0x6
#define _AT1STPTL_STPT6_POSITION                            0x6
#define _AT1STPTL_STPT6_SIZE                                0x1
#define _AT1STPTL_STPT6_LENGTH                              0x1
#define _AT1STPTL_STPT6_MASK                                0x40
#define _AT1STPTL_STPT7_POSN                                0x7
#define _AT1STPTL_STPT7_POSITION                            0x7
#define _AT1STPTL_STPT7_SIZE                                0x1
#define _AT1STPTL_STPT7_LENGTH                              0x1
#define _AT1STPTL_STPT7_MASK                                0x80

// Register: AT1STPTH
#define AT1STPTH AT1STPTH
extern volatile unsigned char           AT1STPTH            __at(0x81B);
#ifndef _LIB_BUILD
asm("AT1STPTH equ 081Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1STPT8               :1;
        unsigned AT1STPT9               :1;
        unsigned AT1STPT10              :1;
        unsigned AT1STPT11              :1;
        unsigned AT1STPT12              :1;
        unsigned AT1STPT13              :1;
        unsigned AT1STPT14              :1;
    };
    struct {
        unsigned STPT8                  :1;
        unsigned STPT9                  :1;
        unsigned STPT10                 :1;
        unsigned STPT11                 :1;
        unsigned STPT12                 :1;
        unsigned STPT13                 :1;
        unsigned STPT14                 :1;
    };
} AT1STPTHbits_t;
extern volatile AT1STPTHbits_t AT1STPTHbits __at(0x81B);
// bitfield macros
#define _AT1STPTH_AT1STPT8_POSN                             0x0
#define _AT1STPTH_AT1STPT8_POSITION                         0x0
#define _AT1STPTH_AT1STPT8_SIZE                             0x1
#define _AT1STPTH_AT1STPT8_LENGTH                           0x1
#define _AT1STPTH_AT1STPT8_MASK                             0x1
#define _AT1STPTH_AT1STPT9_POSN                             0x1
#define _AT1STPTH_AT1STPT9_POSITION                         0x1
#define _AT1STPTH_AT1STPT9_SIZE                             0x1
#define _AT1STPTH_AT1STPT9_LENGTH                           0x1
#define _AT1STPTH_AT1STPT9_MASK                             0x2
#define _AT1STPTH_AT1STPT10_POSN                            0x2
#define _AT1STPTH_AT1STPT10_POSITION                        0x2
#define _AT1STPTH_AT1STPT10_SIZE                            0x1
#define _AT1STPTH_AT1STPT10_LENGTH                          0x1
#define _AT1STPTH_AT1STPT10_MASK                            0x4
#define _AT1STPTH_AT1STPT11_POSN                            0x3
#define _AT1STPTH_AT1STPT11_POSITION                        0x3
#define _AT1STPTH_AT1STPT11_SIZE                            0x1
#define _AT1STPTH_AT1STPT11_LENGTH                          0x1
#define _AT1STPTH_AT1STPT11_MASK                            0x8
#define _AT1STPTH_AT1STPT12_POSN                            0x4
#define _AT1STPTH_AT1STPT12_POSITION                        0x4
#define _AT1STPTH_AT1STPT12_SIZE                            0x1
#define _AT1STPTH_AT1STPT12_LENGTH                          0x1
#define _AT1STPTH_AT1STPT12_MASK                            0x10
#define _AT1STPTH_AT1STPT13_POSN                            0x5
#define _AT1STPTH_AT1STPT13_POSITION                        0x5
#define _AT1STPTH_AT1STPT13_SIZE                            0x1
#define _AT1STPTH_AT1STPT13_LENGTH                          0x1
#define _AT1STPTH_AT1STPT13_MASK                            0x20
#define _AT1STPTH_AT1STPT14_POSN                            0x6
#define _AT1STPTH_AT1STPT14_POSITION                        0x6
#define _AT1STPTH_AT1STPT14_SIZE                            0x1
#define _AT1STPTH_AT1STPT14_LENGTH                          0x1
#define _AT1STPTH_AT1STPT14_MASK                            0x40
#define _AT1STPTH_STPT8_POSN                                0x0
#define _AT1STPTH_STPT8_POSITION                            0x0
#define _AT1STPTH_STPT8_SIZE                                0x1
#define _AT1STPTH_STPT8_LENGTH                              0x1
#define _AT1STPTH_STPT8_MASK                                0x1
#define _AT1STPTH_STPT9_POSN                                0x1
#define _AT1STPTH_STPT9_POSITION                            0x1
#define _AT1STPTH_STPT9_SIZE                                0x1
#define _AT1STPTH_STPT9_LENGTH                              0x1
#define _AT1STPTH_STPT9_MASK                                0x2
#define _AT1STPTH_STPT10_POSN                               0x2
#define _AT1STPTH_STPT10_POSITION                           0x2
#define _AT1STPTH_STPT10_SIZE                               0x1
#define _AT1STPTH_STPT10_LENGTH                             0x1
#define _AT1STPTH_STPT10_MASK                               0x4
#define _AT1STPTH_STPT11_POSN                               0x3
#define _AT1STPTH_STPT11_POSITION                           0x3
#define _AT1STPTH_STPT11_SIZE                               0x1
#define _AT1STPTH_STPT11_LENGTH                             0x1
#define _AT1STPTH_STPT11_MASK                               0x8
#define _AT1STPTH_STPT12_POSN                               0x4
#define _AT1STPTH_STPT12_POSITION                           0x4
#define _AT1STPTH_STPT12_SIZE                               0x1
#define _AT1STPTH_STPT12_LENGTH                             0x1
#define _AT1STPTH_STPT12_MASK                               0x10
#define _AT1STPTH_STPT13_POSN                               0x5
#define _AT1STPTH_STPT13_POSITION                           0x5
#define _AT1STPTH_STPT13_SIZE                               0x1
#define _AT1STPTH_STPT13_LENGTH                             0x1
#define _AT1STPTH_STPT13_MASK                               0x20
#define _AT1STPTH_STPT14_POSN                               0x6
#define _AT1STPTH_STPT14_POSITION                           0x6
#define _AT1STPTH_STPT14_SIZE                               0x1
#define _AT1STPTH_STPT14_LENGTH                             0x1
#define _AT1STPTH_STPT14_MASK                               0x40

// Register: AT1ERR
#define AT1ERR AT1ERR
extern volatile unsigned short          AT1ERR              __at(0x81C);
#ifndef _LIB_BUILD
asm("AT1ERR equ 081Ch");
#endif

