MikroElektronika/core_packages/PIC/XC8/def/PIC16F1615/mcu.h
extern volatile AT1CLKbits_t AT1CLKbits __at(0x88C);
// bitfield macros
#define _AT1CLK_CS_POSN                                     0x0
#define _AT1CLK_CS_POSITION                                 0x0
#define _AT1CLK_CS_SIZE                                     0x1
#define _AT1CLK_CS_LENGTH                                   0x1
#define _AT1CLK_CS_MASK                                     0x1
#define _AT1CLK_AT1CS_POSN                                  0x0
#define _AT1CLK_AT1CS_POSITION                              0x0
#define _AT1CLK_AT1CS_SIZE                                  0x1
#define _AT1CLK_AT1CS_LENGTH                                0x1
#define _AT1CLK_AT1CS_MASK                                  0x1
#define _AT1CLK_CS0_POSN                                    0x0
#define _AT1CLK_CS0_POSITION                                0x0
#define _AT1CLK_CS0_SIZE                                    0x1
#define _AT1CLK_CS0_LENGTH                                  0x1
#define _AT1CLK_CS0_MASK                                    0x1
#define _AT1CLK_AT1CS0_POSN                                 0x0
#define _AT1CLK_AT1CS0_POSITION                             0x0
#define _AT1CLK_AT1CS0_SIZE                                 0x1
#define _AT1CLK_AT1CS0_LENGTH                               0x1
#define _AT1CLK_AT1CS0_MASK                                 0x1

// Register: AT1SIG
#define AT1SIG AT1SIG
extern volatile unsigned char           AT1SIG              __at(0x88D);
#ifndef _LIB_BUILD
asm("AT1SIG equ 088Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSEL                   :3;
    };
    struct {
        unsigned AT1SSEL0               :1;
        unsigned AT1SSEL1               :1;
        unsigned AT1SSEL2               :1;
    };
    struct {
        unsigned SSEL0                  :1;
        unsigned SSEL1                  :1;
        unsigned SSEL2                  :1;
    };
    struct {
        unsigned AT1SSEL                :3;
    };
} AT1SIGbits_t;
extern volatile AT1SIGbits_t AT1SIGbits __at(0x88D);
// bitfield macros
#define _AT1SIG_SSEL_POSN                                   0x0
#define _AT1SIG_SSEL_POSITION                               0x0
#define _AT1SIG_SSEL_SIZE                                   0x3
#define _AT1SIG_SSEL_LENGTH                                 0x3
#define _AT1SIG_SSEL_MASK                                   0x7
#define _AT1SIG_AT1SSEL0_POSN                               0x0
#define _AT1SIG_AT1SSEL0_POSITION                           0x0
#define _AT1SIG_AT1SSEL0_SIZE                               0x1
#define _AT1SIG_AT1SSEL0_LENGTH                             0x1
#define _AT1SIG_AT1SSEL0_MASK                               0x1
#define _AT1SIG_AT1SSEL1_POSN                               0x1
#define _AT1SIG_AT1SSEL1_POSITION                           0x1
#define _AT1SIG_AT1SSEL1_SIZE                               0x1
#define _AT1SIG_AT1SSEL1_LENGTH                             0x1
#define _AT1SIG_AT1SSEL1_MASK                               0x2
#define _AT1SIG_AT1SSEL2_POSN                               0x2
#define _AT1SIG_AT1SSEL2_POSITION                           0x2
#define _AT1SIG_AT1SSEL2_SIZE                               0x1
#define _AT1SIG_AT1SSEL2_LENGTH                             0x1
#define _AT1SIG_AT1SSEL2_MASK                               0x4
#define _AT1SIG_SSEL0_POSN                                  0x0
#define _AT1SIG_SSEL0_POSITION                              0x0
#define _AT1SIG_SSEL0_SIZE                                  0x1
#define _AT1SIG_SSEL0_LENGTH                                0x1
#define _AT1SIG_SSEL0_MASK                                  0x1
#define _AT1SIG_SSEL1_POSN                                  0x1
#define _AT1SIG_SSEL1_POSITION                              0x1
#define _AT1SIG_SSEL1_SIZE                                  0x1
#define _AT1SIG_SSEL1_LENGTH                                0x1
#define _AT1SIG_SSEL1_MASK                                  0x2
#define _AT1SIG_SSEL2_POSN                                  0x2
#define _AT1SIG_SSEL2_POSITION                              0x2
#define _AT1SIG_SSEL2_SIZE                                  0x1
#define _AT1SIG_SSEL2_LENGTH                                0x1
#define _AT1SIG_SSEL2_MASK                                  0x4
#define _AT1SIG_AT1SSEL_POSN                                0x0
#define _AT1SIG_AT1SSEL_POSITION                            0x0
#define _AT1SIG_AT1SSEL_SIZE                                0x3
#define _AT1SIG_AT1SSEL_LENGTH                              0x3
#define _AT1SIG_AT1SSEL_MASK                                0x7

// Register: AT1CSEL1
#define AT1CSEL1 AT1CSEL1
extern volatile unsigned char           AT1CSEL1            __at(0x88E);
#ifndef _LIB_BUILD
asm("AT1CSEL1 equ 088Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CP1S                   :3;
    };
    struct {
        unsigned AT1CP1S0               :1;
        unsigned AT1CP1S1               :1;
        unsigned AT1CP1S2               :1;
    };
    struct {
        unsigned CP1S0                  :1;
        unsigned CP1S1                  :1;
        unsigned CP1S2                  :1;
    };
    struct {
        unsigned AT1CP1S                :3;
    };
} AT1CSEL1bits_t;
extern volatile AT1CSEL1bits_t AT1CSEL1bits __at(0x88E);
// bitfield macros
#define _AT1CSEL1_CP1S_POSN                                 0x0
#define _AT1CSEL1_CP1S_POSITION                             0x0
#define _AT1CSEL1_CP1S_SIZE                                 0x3
#define _AT1CSEL1_CP1S_LENGTH                               0x3
#define _AT1CSEL1_CP1S_MASK                                 0x7
#define _AT1CSEL1_AT1CP1S0_POSN                             0x0
#define _AT1CSEL1_AT1CP1S0_POSITION                         0x0
#define _AT1CSEL1_AT1CP1S0_SIZE                             0x1
#define _AT1CSEL1_AT1CP1S0_LENGTH                           0x1
#define _AT1CSEL1_AT1CP1S0_MASK                             0x1
#define _AT1CSEL1_AT1CP1S1_POSN                             0x1
#define _AT1CSEL1_AT1CP1S1_POSITION                         0x1
#define _AT1CSEL1_AT1CP1S1_SIZE                             0x1
#define _AT1CSEL1_AT1CP1S1_LENGTH                           0x1
#define _AT1CSEL1_AT1CP1S1_MASK                             0x2
#define _AT1CSEL1_AT1CP1S2_POSN                             0x2
#define _AT1CSEL1_AT1CP1S2_POSITION                         0x2
#define _AT1CSEL1_AT1CP1S2_SIZE                             0x1
#define _AT1CSEL1_AT1CP1S2_LENGTH                           0x1
#define _AT1CSEL1_AT1CP1S2_MASK                             0x4
#define _AT1CSEL1_CP1S0_POSN                                0x0
#define _AT1CSEL1_CP1S0_POSITION                            0x0
#define _AT1CSEL1_CP1S0_SIZE                                0x1
#define _AT1CSEL1_CP1S0_LENGTH                              0x1
#define _AT1CSEL1_CP1S0_MASK                                0x1
#define _AT1CSEL1_CP1S1_POSN                                0x1
#define _AT1CSEL1_CP1S1_POSITION                            0x1
#define _AT1CSEL1_CP1S1_SIZE                                0x1
#define _AT1CSEL1_CP1S1_LENGTH                              0x1
#define _AT1CSEL1_CP1S1_MASK                                0x2
#define _AT1CSEL1_CP1S2_POSN                                0x2
#define _AT1CSEL1_CP1S2_POSITION                            0x2
#define _AT1CSEL1_CP1S2_SIZE                                0x1
#define _AT1CSEL1_CP1S2_LENGTH                              0x1
#define _AT1CSEL1_CP1S2_MASK                                0x4
#define _AT1CSEL1_AT1CP1S_POSN                              0x0
#define _AT1CSEL1_AT1CP1S_POSITION                          0x0
#define _AT1CSEL1_AT1CP1S_SIZE                              0x3
#define _AT1CSEL1_AT1CP1S_LENGTH                            0x3
#define _AT1CSEL1_AT1CP1S_MASK                              0x7

// Register: AT1CC1
#define AT1CC1 AT1CC1
extern volatile unsigned short          AT1CC1              __at(0x88F);
#ifndef _LIB_BUILD
asm("AT1CC1 equ 088Fh");
#endif

// Register: AT1CC1L
#define AT1CC1L AT1CC1L
extern volatile unsigned char           AT1CC1L             __at(0x88F);
#ifndef _LIB_BUILD
asm("AT1CC1L equ 088Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1CC10                :1;
        unsigned AT1CC11                :1;
        unsigned AT1CC12                :1;
        unsigned AT1CC13                :1;
        unsigned AT1CC14                :1;
        unsigned AT1CC15                :1;
        unsigned AT1CC16                :1;
        unsigned AT1CC17                :1;
    };
    struct {
        unsigned CC10                   :1;
        unsigned CC11                   :1;
        unsigned CC12                   :1;
        unsigned CC13                   :1;
        unsigned CC14                   :1;
        unsigned CC15                   :1;
        unsigned CC16                   :1;
        unsigned CC17                   :1;
    };
} AT1CC1Lbits_t;
extern volatile AT1CC1Lbits_t AT1CC1Lbits __at(0x88F);
// bitfield macros
#define _AT1CC1L_AT1CC10_POSN                               0x0
#define _AT1CC1L_AT1CC10_POSITION                           0x0
#define _AT1CC1L_AT1CC10_SIZE                               0x1
#define _AT1CC1L_AT1CC10_LENGTH                             0x1
#define _AT1CC1L_AT1CC10_MASK                               0x1
#define _AT1CC1L_AT1CC11_POSN                               0x1
#define _AT1CC1L_AT1CC11_POSITION                           0x1
#define _AT1CC1L_AT1CC11_SIZE                               0x1
#define _AT1CC1L_AT1CC11_LENGTH                             0x1
#define _AT1CC1L_AT1CC11_MASK                               0x2
#define _AT1CC1L_AT1CC12_POSN                               0x2
#define _AT1CC1L_AT1CC12_POSITION                           0x2
#define _AT1CC1L_AT1CC12_SIZE                               0x1
#define _AT1CC1L_AT1CC12_LENGTH                             0x1
#define _AT1CC1L_AT1CC12_MASK                               0x4
#define _AT1CC1L_AT1CC13_POSN                               0x3
#define _AT1CC1L_AT1CC13_POSITION                           0x3
#define _AT1CC1L_AT1CC13_SIZE                               0x1
#define _AT1CC1L_AT1CC13_LENGTH                             0x1
#define _AT1CC1L_AT1CC13_MASK                               0x8
#define _AT1CC1L_AT1CC14_POSN                               0x4
#define _AT1CC1L_AT1CC14_POSITION                           0x4
#define _AT1CC1L_AT1CC14_SIZE                               0x1
#define _AT1CC1L_AT1CC14_LENGTH                             0x1
#define _AT1CC1L_AT1CC14_MASK                               0x10
#define _AT1CC1L_AT1CC15_POSN                               0x5
#define _AT1CC1L_AT1CC15_POSITION                           0x5
#define _AT1CC1L_AT1CC15_SIZE                               0x1
#define _AT1CC1L_AT1CC15_LENGTH                             0x1
#define _AT1CC1L_AT1CC15_MASK                               0x20
#define _AT1CC1L_AT1CC16_POSN                               0x6
#define _AT1CC1L_AT1CC16_POSITION                           0x6
#define _AT1CC1L_AT1CC16_SIZE                               0x1
#define _AT1CC1L_AT1CC16_LENGTH                             0x1
#define _AT1CC1L_AT1CC16_MASK                               0x40
#define _AT1CC1L_AT1CC17_POSN                               0x7
#define _AT1CC1L_AT1CC17_POSITION                           0x7
#define _AT1CC1L_AT1CC17_SIZE                               0x1
#define _AT1CC1L_AT1CC17_LENGTH                             0x1
#define _AT1CC1L_AT1CC17_MASK                               0x80
#define _AT1CC1L_CC10_POSN                                  0x0
#define _AT1CC1L_CC10_POSITION                              0x0
#define _AT1CC1L_CC10_SIZE                                  0x1
#define _AT1CC1L_CC10_LENGTH                                0x1
#define _AT1CC1L_CC10_MASK                                  0x1
#define _AT1CC1L_CC11_POSN                                  0x1
#define _AT1CC1L_CC11_POSITION                              0x1
#define _AT1CC1L_CC11_SIZE                                  0x1
#define _AT1CC1L_CC11_LENGTH                                0x1
#define _AT1CC1L_CC11_MASK                                  0x2
#define _AT1CC1L_CC12_POSN                                  0x2
#define _AT1CC1L_CC12_POSITION                              0x2
#define _AT1CC1L_CC12_SIZE                                  0x1
#define _AT1CC1L_CC12_LENGTH                                0x1
#define _AT1CC1L_CC12_MASK                                  0x4
#define _AT1CC1L_CC13_POSN                                  0x3
#define _AT1CC1L_CC13_POSITION                              0x3
#define _AT1CC1L_CC13_SIZE                                  0x1
#define _AT1CC1L_CC13_LENGTH                                0x1
#define _AT1CC1L_CC13_MASK                                  0x8
#define _AT1CC1L_CC14_POSN                                  0x4
#define _AT1CC1L_CC14_POSITION                              0x4
#define _AT1CC1L_CC14_SIZE                                  0x1
#define _AT1CC1L_CC14_LENGTH                                0x1
#define _AT1CC1L_CC14_MASK                                  0x10
#define _AT1CC1L_CC15_POSN                                  0x5
#define _AT1CC1L_CC15_POSITION                              0x5
#define _AT1CC1L_CC15_SIZE                                  0x1
#define _AT1CC1L_CC15_LENGTH                                0x1
#define _AT1CC1L_CC15_MASK                                  0x20
#define _AT1CC1L_CC16_POSN                                  0x6
#define _AT1CC1L_CC16_POSITION                              0x6
#define _AT1CC1L_CC16_SIZE                                  0x1
#define _AT1CC1L_CC16_LENGTH                                0x1
#define _AT1CC1L_CC16_MASK                                  0x40
#define _AT1CC1L_CC17_POSN                                  0x7
#define _AT1CC1L_CC17_POSITION                              0x7
#define _AT1CC1L_CC17_SIZE                                  0x1
#define _AT1CC1L_CC17_LENGTH                                0x1
#define _AT1CC1L_CC17_MASK                                  0x80

// Register: AT1CC1H
#define AT1CC1H AT1CC1H
extern volatile unsigned char           AT1CC1H             __at(0x890);
#ifndef _LIB_BUILD
asm("AT1CC1H equ 0890h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1CC18                :1;
        unsigned AT1CC19                :1;
    };
    struct {
        unsigned CC18                   :1;
        unsigned CC19                   :1;
    };
} AT1CC1Hbits_t;
