MikroElektronika/core_packages/PIC/XC8/def/PIC16F1615/mcu.h
extern volatile SMT2CLKbits_t SMT2CLKbits __at(0xDAD);
// bitfield macros
#define _SMT2CLK_CSEL_POSN                                  0x0
#define _SMT2CLK_CSEL_POSITION                              0x0
#define _SMT2CLK_CSEL_SIZE                                  0x8
#define _SMT2CLK_CSEL_LENGTH                                0x8
#define _SMT2CLK_CSEL_MASK                                  0xFF
#define _SMT2CLK_CSEL0_POSN                                 0x0
#define _SMT2CLK_CSEL0_POSITION                             0x0
#define _SMT2CLK_CSEL0_SIZE                                 0x1
#define _SMT2CLK_CSEL0_LENGTH                               0x1
#define _SMT2CLK_CSEL0_MASK                                 0x1
#define _SMT2CLK_CSEL1_POSN                                 0x1
#define _SMT2CLK_CSEL1_POSITION                             0x1
#define _SMT2CLK_CSEL1_SIZE                                 0x1
#define _SMT2CLK_CSEL1_LENGTH                               0x1
#define _SMT2CLK_CSEL1_MASK                                 0x2
#define _SMT2CLK_CSEL2_POSN                                 0x2
#define _SMT2CLK_CSEL2_POSITION                             0x2
#define _SMT2CLK_CSEL2_SIZE                                 0x1
#define _SMT2CLK_CSEL2_LENGTH                               0x1
#define _SMT2CLK_CSEL2_MASK                                 0x4
#define _SMT2CLK_SMT2CSEL_POSN                              0x0
#define _SMT2CLK_SMT2CSEL_POSITION                          0x0
#define _SMT2CLK_SMT2CSEL_SIZE                              0x8
#define _SMT2CLK_SMT2CSEL_LENGTH                            0x8
#define _SMT2CLK_SMT2CSEL_MASK                              0xFF
#define _SMT2CLK_SMT2CSEL0_POSN                             0x0
#define _SMT2CLK_SMT2CSEL0_POSITION                         0x0
#define _SMT2CLK_SMT2CSEL0_SIZE                             0x1
#define _SMT2CLK_SMT2CSEL0_LENGTH                           0x1
#define _SMT2CLK_SMT2CSEL0_MASK                             0x1
#define _SMT2CLK_SMT2CSEL1_POSN                             0x1
#define _SMT2CLK_SMT2CSEL1_POSITION                         0x1
#define _SMT2CLK_SMT2CSEL1_SIZE                             0x1
#define _SMT2CLK_SMT2CSEL1_LENGTH                           0x1
#define _SMT2CLK_SMT2CSEL1_MASK                             0x2
#define _SMT2CLK_SMT2CSEL2_POSN                             0x2
#define _SMT2CLK_SMT2CSEL2_POSITION                         0x2
#define _SMT2CLK_SMT2CSEL2_SIZE                             0x1
#define _SMT2CLK_SMT2CSEL2_LENGTH                           0x1
#define _SMT2CLK_SMT2CSEL2_MASK                             0x4

// Register: SMT2SIG
#define SMT2SIG SMT2SIG
extern volatile unsigned char           SMT2SIG             __at(0xDAE);
#ifndef _LIB_BUILD
asm("SMT2SIG equ 0DAEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSEL                   :8;
    };
    struct {
        unsigned SSEL0                  :1;
        unsigned SSEL1                  :1;
        unsigned SSEL2                  :1;
        unsigned SSEL3                  :1;
        unsigned SSEL4                  :1;
    };
    struct {
        unsigned SMT2SSEL               :8;
    };
    struct {
        unsigned SMT2SSEL0              :1;
        unsigned SMT2SSEL1              :1;
        unsigned SMT2SSEL2              :1;
        unsigned SMT2SSEL3              :1;
        unsigned SMT2SSEL4              :1;
    };
} SMT2SIGbits_t;
extern volatile SMT2SIGbits_t SMT2SIGbits __at(0xDAE);
// bitfield macros
#define _SMT2SIG_SSEL_POSN                                  0x0
#define _SMT2SIG_SSEL_POSITION                              0x0
#define _SMT2SIG_SSEL_SIZE                                  0x8
#define _SMT2SIG_SSEL_LENGTH                                0x8
#define _SMT2SIG_SSEL_MASK                                  0xFF
#define _SMT2SIG_SSEL0_POSN                                 0x0
#define _SMT2SIG_SSEL0_POSITION                             0x0
#define _SMT2SIG_SSEL0_SIZE                                 0x1
#define _SMT2SIG_SSEL0_LENGTH                               0x1
#define _SMT2SIG_SSEL0_MASK                                 0x1
#define _SMT2SIG_SSEL1_POSN                                 0x1
#define _SMT2SIG_SSEL1_POSITION                             0x1
#define _SMT2SIG_SSEL1_SIZE                                 0x1
#define _SMT2SIG_SSEL1_LENGTH                               0x1
#define _SMT2SIG_SSEL1_MASK                                 0x2
#define _SMT2SIG_SSEL2_POSN                                 0x2
#define _SMT2SIG_SSEL2_POSITION                             0x2
#define _SMT2SIG_SSEL2_SIZE                                 0x1
#define _SMT2SIG_SSEL2_LENGTH                               0x1
#define _SMT2SIG_SSEL2_MASK                                 0x4
#define _SMT2SIG_SSEL3_POSN                                 0x3
#define _SMT2SIG_SSEL3_POSITION                             0x3
#define _SMT2SIG_SSEL3_SIZE                                 0x1
#define _SMT2SIG_SSEL3_LENGTH                               0x1
#define _SMT2SIG_SSEL3_MASK                                 0x8
#define _SMT2SIG_SSEL4_POSN                                 0x4
#define _SMT2SIG_SSEL4_POSITION                             0x4
#define _SMT2SIG_SSEL4_SIZE                                 0x1
#define _SMT2SIG_SSEL4_LENGTH                               0x1
#define _SMT2SIG_SSEL4_MASK                                 0x10
#define _SMT2SIG_SMT2SSEL_POSN                              0x0
#define _SMT2SIG_SMT2SSEL_POSITION                          0x0
#define _SMT2SIG_SMT2SSEL_SIZE                              0x8
#define _SMT2SIG_SMT2SSEL_LENGTH                            0x8
#define _SMT2SIG_SMT2SSEL_MASK                              0xFF
#define _SMT2SIG_SMT2SSEL0_POSN                             0x0
#define _SMT2SIG_SMT2SSEL0_POSITION                         0x0
#define _SMT2SIG_SMT2SSEL0_SIZE                             0x1
#define _SMT2SIG_SMT2SSEL0_LENGTH                           0x1
#define _SMT2SIG_SMT2SSEL0_MASK                             0x1
#define _SMT2SIG_SMT2SSEL1_POSN                             0x1
#define _SMT2SIG_SMT2SSEL1_POSITION                         0x1
#define _SMT2SIG_SMT2SSEL1_SIZE                             0x1
#define _SMT2SIG_SMT2SSEL1_LENGTH                           0x1
#define _SMT2SIG_SMT2SSEL1_MASK                             0x2
#define _SMT2SIG_SMT2SSEL2_POSN                             0x2
#define _SMT2SIG_SMT2SSEL2_POSITION                         0x2
#define _SMT2SIG_SMT2SSEL2_SIZE                             0x1
#define _SMT2SIG_SMT2SSEL2_LENGTH                           0x1
#define _SMT2SIG_SMT2SSEL2_MASK                             0x4
#define _SMT2SIG_SMT2SSEL3_POSN                             0x3
#define _SMT2SIG_SMT2SSEL3_POSITION                         0x3
#define _SMT2SIG_SMT2SSEL3_SIZE                             0x1
#define _SMT2SIG_SMT2SSEL3_LENGTH                           0x1
#define _SMT2SIG_SMT2SSEL3_MASK                             0x8
#define _SMT2SIG_SMT2SSEL4_POSN                             0x4
#define _SMT2SIG_SMT2SSEL4_POSITION                         0x4
#define _SMT2SIG_SMT2SSEL4_SIZE                             0x1
#define _SMT2SIG_SMT2SSEL4_LENGTH                           0x1
#define _SMT2SIG_SMT2SSEL4_MASK                             0x10

// Register: SMT2WIN
#define SMT2WIN SMT2WIN
extern volatile unsigned char           SMT2WIN             __at(0xDAF);
#ifndef _LIB_BUILD
asm("SMT2WIN equ 0DAFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WSEL                   :8;
    };
    struct {
        unsigned WSEL0                  :1;
        unsigned WSEL1                  :1;
        unsigned WSEL2                  :1;
        unsigned WSEL3                  :1;
        unsigned WSEL4                  :1;
    };
    struct {
        unsigned SMT2WSEL               :8;
    };
    struct {
        unsigned SMT2WSEL0              :1;
        unsigned SMT2WSEL1              :1;
        unsigned SMT2WSEL2              :1;
        unsigned SMT2WSEL3              :1;
        unsigned SMT2WSEL4              :1;
    };
} SMT2WINbits_t;
extern volatile SMT2WINbits_t SMT2WINbits __at(0xDAF);
// bitfield macros
#define _SMT2WIN_WSEL_POSN                                  0x0
#define _SMT2WIN_WSEL_POSITION                              0x0
#define _SMT2WIN_WSEL_SIZE                                  0x8
#define _SMT2WIN_WSEL_LENGTH                                0x8
#define _SMT2WIN_WSEL_MASK                                  0xFF
#define _SMT2WIN_WSEL0_POSN                                 0x0
#define _SMT2WIN_WSEL0_POSITION                             0x0
#define _SMT2WIN_WSEL0_SIZE                                 0x1
#define _SMT2WIN_WSEL0_LENGTH                               0x1
#define _SMT2WIN_WSEL0_MASK                                 0x1
#define _SMT2WIN_WSEL1_POSN                                 0x1
#define _SMT2WIN_WSEL1_POSITION                             0x1
#define _SMT2WIN_WSEL1_SIZE                                 0x1
#define _SMT2WIN_WSEL1_LENGTH                               0x1
#define _SMT2WIN_WSEL1_MASK                                 0x2
#define _SMT2WIN_WSEL2_POSN                                 0x2
#define _SMT2WIN_WSEL2_POSITION                             0x2
#define _SMT2WIN_WSEL2_SIZE                                 0x1
#define _SMT2WIN_WSEL2_LENGTH                               0x1
#define _SMT2WIN_WSEL2_MASK                                 0x4
#define _SMT2WIN_WSEL3_POSN                                 0x3
#define _SMT2WIN_WSEL3_POSITION                             0x3
#define _SMT2WIN_WSEL3_SIZE                                 0x1
#define _SMT2WIN_WSEL3_LENGTH                               0x1
#define _SMT2WIN_WSEL3_MASK                                 0x8
#define _SMT2WIN_WSEL4_POSN                                 0x4
#define _SMT2WIN_WSEL4_POSITION                             0x4
#define _SMT2WIN_WSEL4_SIZE                                 0x1
#define _SMT2WIN_WSEL4_LENGTH                               0x1
#define _SMT2WIN_WSEL4_MASK                                 0x10
#define _SMT2WIN_SMT2WSEL_POSN                              0x0
#define _SMT2WIN_SMT2WSEL_POSITION                          0x0
#define _SMT2WIN_SMT2WSEL_SIZE                              0x8
#define _SMT2WIN_SMT2WSEL_LENGTH                            0x8
#define _SMT2WIN_SMT2WSEL_MASK                              0xFF
#define _SMT2WIN_SMT2WSEL0_POSN                             0x0
#define _SMT2WIN_SMT2WSEL0_POSITION                         0x0
#define _SMT2WIN_SMT2WSEL0_SIZE                             0x1
#define _SMT2WIN_SMT2WSEL0_LENGTH                           0x1
#define _SMT2WIN_SMT2WSEL0_MASK                             0x1
#define _SMT2WIN_SMT2WSEL1_POSN                             0x1
#define _SMT2WIN_SMT2WSEL1_POSITION                         0x1
#define _SMT2WIN_SMT2WSEL1_SIZE                             0x1
#define _SMT2WIN_SMT2WSEL1_LENGTH                           0x1
#define _SMT2WIN_SMT2WSEL1_MASK                             0x2
#define _SMT2WIN_SMT2WSEL2_POSN                             0x2
#define _SMT2WIN_SMT2WSEL2_POSITION                         0x2
#define _SMT2WIN_SMT2WSEL2_SIZE                             0x1
#define _SMT2WIN_SMT2WSEL2_LENGTH                           0x1
#define _SMT2WIN_SMT2WSEL2_MASK                             0x4
#define _SMT2WIN_SMT2WSEL3_POSN                             0x3
#define _SMT2WIN_SMT2WSEL3_POSITION                         0x3
#define _SMT2WIN_SMT2WSEL3_SIZE                             0x1
#define _SMT2WIN_SMT2WSEL3_LENGTH                           0x1
#define _SMT2WIN_SMT2WSEL3_MASK                             0x8
#define _SMT2WIN_SMT2WSEL4_POSN                             0x4
#define _SMT2WIN_SMT2WSEL4_POSITION                         0x4
#define _SMT2WIN_SMT2WSEL4_SIZE                             0x1
#define _SMT2WIN_SMT2WSEL4_LENGTH                           0x1
#define _SMT2WIN_SMT2WSEL4_MASK                             0x10

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
extern volatile unsigned char           PPSLOCK             __at(0xE0F);
#ifndef _LIB_BUILD
asm("PPSLOCK equ 0E0Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPSLOCKED              :1;
    };
} PPSLOCKbits_t;
