MikroElektronika/core_packages/PIC/XC8/def/PIC16F1615/mcu.h
extern volatile T6CKIPPSbits_t T6CKIPPSbits __at(0xE1E);
// bitfield macros
#define _T6CKIPPS_T6CKIPPS_POSN                             0x0
#define _T6CKIPPS_T6CKIPPS_POSITION                         0x0
#define _T6CKIPPS_T6CKIPPS_SIZE                             0x5
#define _T6CKIPPS_T6CKIPPS_LENGTH                           0x5
#define _T6CKIPPS_T6CKIPPS_MASK                             0x1F
#define _T6CKIPPS_T6CKIPPS0_POSN                            0x0
#define _T6CKIPPS_T6CKIPPS0_POSITION                        0x0
#define _T6CKIPPS_T6CKIPPS0_SIZE                            0x1
#define _T6CKIPPS_T6CKIPPS0_LENGTH                          0x1
#define _T6CKIPPS_T6CKIPPS0_MASK                            0x1
#define _T6CKIPPS_T6CKIPPS1_POSN                            0x1
#define _T6CKIPPS_T6CKIPPS1_POSITION                        0x1
#define _T6CKIPPS_T6CKIPPS1_SIZE                            0x1
#define _T6CKIPPS_T6CKIPPS1_LENGTH                          0x1
#define _T6CKIPPS_T6CKIPPS1_MASK                            0x2
#define _T6CKIPPS_T6CKIPPS2_POSN                            0x2
#define _T6CKIPPS_T6CKIPPS2_POSITION                        0x2
#define _T6CKIPPS_T6CKIPPS2_SIZE                            0x1
#define _T6CKIPPS_T6CKIPPS2_LENGTH                          0x1
#define _T6CKIPPS_T6CKIPPS2_MASK                            0x4
#define _T6CKIPPS_T6CKIPPS3_POSN                            0x3
#define _T6CKIPPS_T6CKIPPS3_POSITION                        0x3
#define _T6CKIPPS_T6CKIPPS3_SIZE                            0x1
#define _T6CKIPPS_T6CKIPPS3_LENGTH                          0x1
#define _T6CKIPPS_T6CKIPPS3_MASK                            0x8
#define _T6CKIPPS_T6CKIPPS4_POSN                            0x4
#define _T6CKIPPS_T6CKIPPS4_POSITION                        0x4
#define _T6CKIPPS_T6CKIPPS4_SIZE                            0x1
#define _T6CKIPPS_T6CKIPPS4_LENGTH                          0x1
#define _T6CKIPPS_T6CKIPPS4_MASK                            0x10
#define _T6CKIPPS_T6PPS_POSN                                0x0
#define _T6CKIPPS_T6PPS_POSITION                            0x0
#define _T6CKIPPS_T6PPS_SIZE                                0x5
#define _T6CKIPPS_T6PPS_LENGTH                              0x5
#define _T6CKIPPS_T6PPS_MASK                                0x1F
#define _T6CKIPPS_T6PPS0_POSN                               0x0
#define _T6CKIPPS_T6PPS0_POSITION                           0x0
#define _T6CKIPPS_T6PPS0_SIZE                               0x1
#define _T6CKIPPS_T6PPS0_LENGTH                             0x1
#define _T6CKIPPS_T6PPS0_MASK                               0x1
#define _T6CKIPPS_T6PPS1_POSN                               0x1
#define _T6CKIPPS_T6PPS1_POSITION                           0x1
#define _T6CKIPPS_T6PPS1_SIZE                               0x1
#define _T6CKIPPS_T6PPS1_LENGTH                             0x1
#define _T6CKIPPS_T6PPS1_MASK                               0x2
#define _T6CKIPPS_T6PPS2_POSN                               0x2
#define _T6CKIPPS_T6PPS2_POSITION                           0x2
#define _T6CKIPPS_T6PPS2_SIZE                               0x1
#define _T6CKIPPS_T6PPS2_LENGTH                             0x1
#define _T6CKIPPS_T6PPS2_MASK                               0x4
#define _T6CKIPPS_T6PPS3_POSN                               0x3
#define _T6CKIPPS_T6PPS3_POSITION                           0x3
#define _T6CKIPPS_T6PPS3_SIZE                               0x1
#define _T6CKIPPS_T6PPS3_LENGTH                             0x1
#define _T6CKIPPS_T6PPS3_MASK                               0x8
#define _T6CKIPPS_T6PPS4_POSN                               0x4
#define _T6CKIPPS_T6PPS4_POSITION                           0x4
#define _T6CKIPPS_T6PPS4_SIZE                               0x1
#define _T6CKIPPS_T6PPS4_LENGTH                             0x1
#define _T6CKIPPS_T6PPS4_MASK                               0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned T6CKIPPS               :5;
    };
    struct {
        unsigned T6CKIPPS0              :1;
        unsigned T6CKIPPS1              :1;
        unsigned T6CKIPPS2              :1;
        unsigned T6CKIPPS3              :1;
        unsigned T6CKIPPS4              :1;
    };
    struct {
        unsigned T6PPS                  :5;
    };
    struct {
        unsigned T6PPS0                 :1;
        unsigned T6PPS1                 :1;
        unsigned T6PPS2                 :1;
        unsigned T6PPS3                 :1;
        unsigned T6PPS4                 :1;
    };
} T6PPSbits_t;
extern volatile T6PPSbits_t T6PPSbits __at(0xE1E);
// bitfield macros
#define _T6PPS_T6CKIPPS_POSN                                0x0
#define _T6PPS_T6CKIPPS_POSITION                            0x0
#define _T6PPS_T6CKIPPS_SIZE                                0x5
#define _T6PPS_T6CKIPPS_LENGTH                              0x5
#define _T6PPS_T6CKIPPS_MASK                                0x1F
#define _T6PPS_T6CKIPPS0_POSN                               0x0
#define _T6PPS_T6CKIPPS0_POSITION                           0x0
#define _T6PPS_T6CKIPPS0_SIZE                               0x1
#define _T6PPS_T6CKIPPS0_LENGTH                             0x1
#define _T6PPS_T6CKIPPS0_MASK                               0x1
#define _T6PPS_T6CKIPPS1_POSN                               0x1
#define _T6PPS_T6CKIPPS1_POSITION                           0x1
#define _T6PPS_T6CKIPPS1_SIZE                               0x1
#define _T6PPS_T6CKIPPS1_LENGTH                             0x1
#define _T6PPS_T6CKIPPS1_MASK                               0x2
#define _T6PPS_T6CKIPPS2_POSN                               0x2
#define _T6PPS_T6CKIPPS2_POSITION                           0x2
#define _T6PPS_T6CKIPPS2_SIZE                               0x1
#define _T6PPS_T6CKIPPS2_LENGTH                             0x1
#define _T6PPS_T6CKIPPS2_MASK                               0x4
#define _T6PPS_T6CKIPPS3_POSN                               0x3
#define _T6PPS_T6CKIPPS3_POSITION                           0x3
#define _T6PPS_T6CKIPPS3_SIZE                               0x1
#define _T6PPS_T6CKIPPS3_LENGTH                             0x1
#define _T6PPS_T6CKIPPS3_MASK                               0x8
#define _T6PPS_T6CKIPPS4_POSN                               0x4
#define _T6PPS_T6CKIPPS4_POSITION                           0x4
#define _T6PPS_T6CKIPPS4_SIZE                               0x1
#define _T6PPS_T6CKIPPS4_LENGTH                             0x1
#define _T6PPS_T6CKIPPS4_MASK                               0x10
#define _T6PPS_T6PPS_POSN                                   0x0
#define _T6PPS_T6PPS_POSITION                               0x0
#define _T6PPS_T6PPS_SIZE                                   0x5
#define _T6PPS_T6PPS_LENGTH                                 0x5
#define _T6PPS_T6PPS_MASK                                   0x1F
#define _T6PPS_T6PPS0_POSN                                  0x0
#define _T6PPS_T6PPS0_POSITION                              0x0
#define _T6PPS_T6PPS0_SIZE                                  0x1
#define _T6PPS_T6PPS0_LENGTH                                0x1
#define _T6PPS_T6PPS0_MASK                                  0x1
#define _T6PPS_T6PPS1_POSN                                  0x1
#define _T6PPS_T6PPS1_POSITION                              0x1
#define _T6PPS_T6PPS1_SIZE                                  0x1
#define _T6PPS_T6PPS1_LENGTH                                0x1
#define _T6PPS_T6PPS1_MASK                                  0x2
#define _T6PPS_T6PPS2_POSN                                  0x2
#define _T6PPS_T6PPS2_POSITION                              0x2
#define _T6PPS_T6PPS2_SIZE                                  0x1
#define _T6PPS_T6PPS2_LENGTH                                0x1
#define _T6PPS_T6PPS2_MASK                                  0x4
#define _T6PPS_T6PPS3_POSN                                  0x3
#define _T6PPS_T6PPS3_POSITION                              0x3
#define _T6PPS_T6PPS3_SIZE                                  0x1
#define _T6PPS_T6PPS3_LENGTH                                0x1
#define _T6PPS_T6PPS3_MASK                                  0x8
#define _T6PPS_T6PPS4_POSN                                  0x4
#define _T6PPS_T6PPS4_POSITION                              0x4
#define _T6PPS_T6PPS4_SIZE                                  0x1
#define _T6PPS_T6PPS4_LENGTH                                0x1
#define _T6PPS_T6PPS4_MASK                                  0x10

// Register: ATCC1PPS
#define ATCC1PPS ATCC1PPS
extern volatile unsigned char           ATCC1PPS            __at(0xE1F);
#ifndef _LIB_BUILD
asm("ATCC1PPS equ 0E1Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ATCC1PPS               :5;
    };
    struct {
        unsigned ATCC1PPS0              :1;
        unsigned ATCC1PPS1              :1;
        unsigned ATCC1PPS2              :1;
        unsigned ATCC1PPS3              :1;
        unsigned ATCC1PPS4              :1;
    };
} ATCC1PPSbits_t;
extern volatile ATCC1PPSbits_t ATCC1PPSbits __at(0xE1F);
// bitfield macros
#define _ATCC1PPS_ATCC1PPS_POSN                             0x0
#define _ATCC1PPS_ATCC1PPS_POSITION                         0x0
#define _ATCC1PPS_ATCC1PPS_SIZE                             0x5
#define _ATCC1PPS_ATCC1PPS_LENGTH                           0x5
#define _ATCC1PPS_ATCC1PPS_MASK                             0x1F
#define _ATCC1PPS_ATCC1PPS0_POSN                            0x0
#define _ATCC1PPS_ATCC1PPS0_POSITION                        0x0
#define _ATCC1PPS_ATCC1PPS0_SIZE                            0x1
#define _ATCC1PPS_ATCC1PPS0_LENGTH                          0x1
#define _ATCC1PPS_ATCC1PPS0_MASK                            0x1
#define _ATCC1PPS_ATCC1PPS1_POSN                            0x1
#define _ATCC1PPS_ATCC1PPS1_POSITION                        0x1
#define _ATCC1PPS_ATCC1PPS1_SIZE                            0x1
#define _ATCC1PPS_ATCC1PPS1_LENGTH                          0x1
#define _ATCC1PPS_ATCC1PPS1_MASK                            0x2
#define _ATCC1PPS_ATCC1PPS2_POSN                            0x2
#define _ATCC1PPS_ATCC1PPS2_POSITION                        0x2
#define _ATCC1PPS_ATCC1PPS2_SIZE                            0x1
#define _ATCC1PPS_ATCC1PPS2_LENGTH                          0x1
#define _ATCC1PPS_ATCC1PPS2_MASK                            0x4
#define _ATCC1PPS_ATCC1PPS3_POSN                            0x3
#define _ATCC1PPS_ATCC1PPS3_POSITION                        0x3
#define _ATCC1PPS_ATCC1PPS3_SIZE                            0x1
#define _ATCC1PPS_ATCC1PPS3_LENGTH                          0x1
#define _ATCC1PPS_ATCC1PPS3_MASK                            0x8
#define _ATCC1PPS_ATCC1PPS4_POSN                            0x4
#define _ATCC1PPS_ATCC1PPS4_POSITION                        0x4
#define _ATCC1PPS_ATCC1PPS4_SIZE                            0x1
#define _ATCC1PPS_ATCC1PPS4_LENGTH                          0x1
#define _ATCC1PPS_ATCC1PPS4_MASK                            0x10

// Register: SSPCLKPPS
#define SSPCLKPPS SSPCLKPPS
extern volatile unsigned char           SSPCLKPPS           __at(0xE20);
#ifndef _LIB_BUILD
asm("SSPCLKPPS equ 0E20h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPCLKPPS              :5;
    };
    struct {
        unsigned SSPCLKPPS0             :1;
        unsigned SSPCLKPPS1             :1;
        unsigned SSPCLKPPS2             :1;
        unsigned SSPCLKPPS3             :1;
        unsigned SSPCLKPPS4             :1;
    };
} SSPCLKPPSbits_t;
extern volatile SSPCLKPPSbits_t SSPCLKPPSbits __at(0xE20);
// bitfield macros
#define _SSPCLKPPS_SSPCLKPPS_POSN                           0x0
#define _SSPCLKPPS_SSPCLKPPS_POSITION                       0x0
#define _SSPCLKPPS_SSPCLKPPS_SIZE                           0x5
#define _SSPCLKPPS_SSPCLKPPS_LENGTH                         0x5
#define _SSPCLKPPS_SSPCLKPPS_MASK                           0x1F
#define _SSPCLKPPS_SSPCLKPPS0_POSN                          0x0
#define _SSPCLKPPS_SSPCLKPPS0_POSITION                      0x0
#define _SSPCLKPPS_SSPCLKPPS0_SIZE                          0x1
#define _SSPCLKPPS_SSPCLKPPS0_LENGTH                        0x1
#define _SSPCLKPPS_SSPCLKPPS0_MASK                          0x1
#define _SSPCLKPPS_SSPCLKPPS1_POSN                          0x1
#define _SSPCLKPPS_SSPCLKPPS1_POSITION                      0x1
#define _SSPCLKPPS_SSPCLKPPS1_SIZE                          0x1
#define _SSPCLKPPS_SSPCLKPPS1_LENGTH                        0x1
#define _SSPCLKPPS_SSPCLKPPS1_MASK                          0x2
#define _SSPCLKPPS_SSPCLKPPS2_POSN                          0x2
#define _SSPCLKPPS_SSPCLKPPS2_POSITION                      0x2
#define _SSPCLKPPS_SSPCLKPPS2_SIZE                          0x1
#define _SSPCLKPPS_SSPCLKPPS2_LENGTH                        0x1
#define _SSPCLKPPS_SSPCLKPPS2_MASK                          0x4
#define _SSPCLKPPS_SSPCLKPPS3_POSN                          0x3
#define _SSPCLKPPS_SSPCLKPPS3_POSITION                      0x3
#define _SSPCLKPPS_SSPCLKPPS3_SIZE                          0x1
#define _SSPCLKPPS_SSPCLKPPS3_LENGTH                        0x1
#define _SSPCLKPPS_SSPCLKPPS3_MASK                          0x8
#define _SSPCLKPPS_SSPCLKPPS4_POSN                          0x4
#define _SSPCLKPPS_SSPCLKPPS4_POSITION                      0x4
#define _SSPCLKPPS_SSPCLKPPS4_SIZE                          0x1
#define _SSPCLKPPS_SSPCLKPPS4_LENGTH                        0x1
#define _SSPCLKPPS_SSPCLKPPS4_MASK                          0x10

// Register: SSPDATPPS
#define SSPDATPPS SSPDATPPS
extern volatile unsigned char           SSPDATPPS           __at(0xE21);
#ifndef _LIB_BUILD
asm("SSPDATPPS equ 0E21h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPDATPPS              :5;
    };
    struct {
        unsigned SSPDATPPS0             :1;
        unsigned SSPDATPPS1             :1;
        unsigned SSPDATPPS2             :1;
        unsigned SSPDATPPS3             :1;
        unsigned SSPDATPPS4             :1;
    };
} SSPDATPPSbits_t;
