MikroElektronika/core_packages/PIC/XC8/def/PIC16F1615/mcu.h
#define                                 ATINPPS2_bit        _BIT_ACCESS(ATINPPS,2)
// ATINPPS<ATINPPS3>
extern volatile __bit                   ATINPPS3            __at(0x70B3);	// @ (0xE16 * 8 + 3)
#define                                 ATINPPS3_bit        _BIT_ACCESS(ATINPPS,3)
// ATINPPS<ATINPPS4>
extern volatile __bit                   ATINPPS4            __at(0x70B4);	// @ (0xE16 * 8 + 4)
#define                                 ATINPPS4_bit        _BIT_ACCESS(ATINPPS,4)
// PIE2<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x48B);	// @ (0x91 * 8 + 3)
#define                                 BCL1IE_bit          _BIT_ACCESS(PIE2,3)
// PIR2<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x8B);	// @ (0x11 * 8 + 3)
#define                                 BCL1IF_bit          _BIT_ACCESS(PIR2,3)
// SSP1STAT<BF>
extern volatile __bit                   BF                  __at(0x10A0);	// @ (0x214 * 8 + 0)
#define                                 BF_bit              _BIT_ACCESS(SSP1STAT,0)
// SSP1CON3<BOEN>
extern volatile __bit                   BOEN                __at(0x10BC);	// @ (0x217 * 8 + 4)
#define                                 BOEN_bit            _BIT_ACCESS(SSP1CON3,4)
// BORCON<BORFS>
extern volatile __bit                   BORFS               __at(0x8B6);	// @ (0x116 * 8 + 6)
#define                                 BORFS_bit           _BIT_ACCESS(BORCON,6)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x8B0);	// @ (0x116 * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// BAUD1CON<BRG16>
extern volatile __bit                   BRG16               __at(0xCFB);	// @ (0x19F * 8 + 3)
#define                                 BRG16_bit           _BIT_ACCESS(BAUD1CON,3)
// TX1STA<BRGH>
extern volatile __bit                   BRGH                __at(0xCF2);	// @ (0x19E * 8 + 2)
#define                                 BRGH_bit            _BIT_ACCESS(TX1STA,2)
// BSR<BSR0>
extern volatile __bit                   BSR0                __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 BSR0_bit            _BIT_ACCESS(BSR,0)
// BSR<BSR1>
extern volatile __bit                   BSR1                __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 BSR1_bit            _BIT_ACCESS(BSR,1)
// BSR<BSR2>
extern volatile __bit                   BSR2                __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 BSR2_bit            _BIT_ACCESS(BSR,2)
// BSR<BSR3>
extern volatile __bit                   BSR3                __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 BSR3_bit            _BIT_ACCESS(BSR,3)
// BSR<BSR4>
extern volatile __bit                   BSR4                __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 BSR4_bit            _BIT_ACCESS(BSR,4)
// SSP1BUF<BUF0>
extern volatile __bit                   BUF0                __at(0x1088);	// @ (0x211 * 8 + 0)
#define                                 BUF0_bit            _BIT_ACCESS(SSP1BUF,0)
// SSP1BUF<BUF1>
extern volatile __bit                   BUF1                __at(0x1089);	// @ (0x211 * 8 + 1)
#define                                 BUF1_bit            _BIT_ACCESS(SSP1BUF,1)
// SSP1BUF<BUF2>
extern volatile __bit                   BUF2                __at(0x108A);	// @ (0x211 * 8 + 2)
#define                                 BUF2_bit            _BIT_ACCESS(SSP1BUF,2)
// SSP1BUF<BUF3>
extern volatile __bit                   BUF3                __at(0x108B);	// @ (0x211 * 8 + 3)
#define                                 BUF3_bit            _BIT_ACCESS(SSP1BUF,3)
// SSP1BUF<BUF4>
extern volatile __bit                   BUF4                __at(0x108C);	// @ (0x211 * 8 + 4)
#define                                 BUF4_bit            _BIT_ACCESS(SSP1BUF,4)
// SSP1BUF<BUF5>
extern volatile __bit                   BUF5                __at(0x108D);	// @ (0x211 * 8 + 5)
#define                                 BUF5_bit            _BIT_ACCESS(SSP1BUF,5)
// SSP1BUF<BUF6>
extern volatile __bit                   BUF6                __at(0x108E);	// @ (0x211 * 8 + 6)
#define                                 BUF6_bit            _BIT_ACCESS(SSP1BUF,6)
// SSP1BUF<BUF7>
extern volatile __bit                   BUF7                __at(0x108F);	// @ (0x211 * 8 + 7)
#define                                 BUF7_bit            _BIT_ACCESS(SSP1BUF,7)
// CWG1AS1<C1AS>
extern volatile __bit                   C1AS                __at(0x34A1);	// @ (0x694 * 8 + 1)
#define                                 C1AS_bit            _BIT_ACCESS(CWG1AS1,1)
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 C1HYS_bit           _BIT_ACCESS(CM1CON0,1)
// PIE2<C1IE>
extern volatile __bit                   C1IE                __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 C1IE_bit            _BIT_ACCESS(PIE2,5)
// PIR2<C1IF>
extern volatile __bit                   C1IF                __at(0x8D);	// @ (0x11 * 8 + 5)
#define                                 C1IF_bit            _BIT_ACCESS(PIR2,5)
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x896);	// @ (0x112 * 8 + 6)
#define                                 C1INTN_bit          _BIT_ACCESS(CM1CON1,6)
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x897);	// @ (0x112 * 8 + 7)
#define                                 C1INTP_bit          _BIT_ACCESS(CM1CON1,7)
// CM1CON1<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x890);	// @ (0x112 * 8 + 0)
#define                                 C1NCH0_bit          _BIT_ACCESS(CM1CON1,0)
// CM1CON1<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x891);	// @ (0x112 * 8 + 1)
#define                                 C1NCH1_bit          _BIT_ACCESS(CM1CON1,1)
// CM1CON1<C1NCH2>
extern volatile __bit                   C1NCH2              __at(0x892);	// @ (0x112 * 8 + 2)
#define                                 C1NCH2_bit          _BIT_ACCESS(CM1CON1,2)
// CM1CON0<C1ON>
extern volatile __bit                   C1ON                __at(0x88F);	// @ (0x111 * 8 + 7)
#define                                 C1ON_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x88E);	// @ (0x111 * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,6)
// CM1CON1<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x894);	// @ (0x112 * 8 + 4)
#define                                 C1PCH0_bit          _BIT_ACCESS(CM1CON1,4)
// CM1CON1<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x895);	// @ (0x112 * 8 + 5)
#define                                 C1PCH1_bit          _BIT_ACCESS(CM1CON1,5)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x88C);	// @ (0x111 * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1SP>
extern volatile __bit                   C1SP                __at(0x88A);	// @ (0x111 * 8 + 2)
#define                                 C1SP_bit            _BIT_ACCESS(CM1CON0,2)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM1CON0,0)
// CWG1AS1<C2AS>
extern volatile __bit                   C2AS                __at(0x34A2);	// @ (0x694 * 8 + 2)
#define                                 C2AS_bit            _BIT_ACCESS(CWG1AS1,2)
// CM2CON0<C2HYS>
extern volatile __bit                   C2HYS               __at(0x899);	// @ (0x113 * 8 + 1)
#define                                 C2HYS_bit           _BIT_ACCESS(CM2CON0,1)
// PIE2<C2IE>
extern volatile __bit                   C2IE                __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 C2IE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<C2IF>
extern volatile __bit                   C2IF                __at(0x8E);	// @ (0x11 * 8 + 6)
#define                                 C2IF_bit            _BIT_ACCESS(PIR2,6)
// CM2CON1<C2INTN>
extern volatile __bit                   C2INTN              __at(0x8A6);	// @ (0x114 * 8 + 6)
#define                                 C2INTN_bit          _BIT_ACCESS(CM2CON1,6)
// CM2CON1<C2INTP>
extern volatile __bit                   C2INTP              __at(0x8A7);	// @ (0x114 * 8 + 7)
#define                                 C2INTP_bit          _BIT_ACCESS(CM2CON1,7)
// CM2CON1<C2NCH0>
extern volatile __bit                   C2NCH0              __at(0x8A0);	// @ (0x114 * 8 + 0)
#define                                 C2NCH0_bit          _BIT_ACCESS(CM2CON1,0)
// CM2CON1<C2NCH1>
extern volatile __bit                   C2NCH1              __at(0x8A1);	// @ (0x114 * 8 + 1)
#define                                 C2NCH1_bit          _BIT_ACCESS(CM2CON1,1)
// CM2CON1<C2NCH2>
extern volatile __bit                   C2NCH2              __at(0x8A2);	// @ (0x114 * 8 + 2)
#define                                 C2NCH2_bit          _BIT_ACCESS(CM2CON1,2)
// CM2CON0<C2ON>
extern volatile __bit                   C2ON                __at(0x89F);	// @ (0x113 * 8 + 7)
#define                                 C2ON_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x89E);	// @ (0x113 * 8 + 6)
#define                                 C2OUT_bit           _BIT_ACCESS(CM2CON0,6)
// CM2CON1<C2PCH0>
extern volatile __bit                   C2PCH0              __at(0x8A4);	// @ (0x114 * 8 + 4)
#define                                 C2PCH0_bit          _BIT_ACCESS(CM2CON1,4)
// CM2CON1<C2PCH1>
extern volatile __bit                   C2PCH1              __at(0x8A5);	// @ (0x114 * 8 + 5)
#define                                 C2PCH1_bit          _BIT_ACCESS(CM2CON1,5)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x89C);	// @ (0x113 * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2SP>
extern volatile __bit                   C2SP                __at(0x89A);	// @ (0x113 * 8 + 2)
#define                                 C2SP_bit            _BIT_ACCESS(CM2CON0,2)
// CM2CON0<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x898);	// @ (0x113 * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON0,0)
// AT1CCON1<CAP1P>
extern volatile __bit                   CAP1P               __at(0x448B);	// @ (0x891 * 8 + 3)
#define                                 CAP1P_bit           _BIT_ACCESS(AT1CCON1,3)
// AT1CCON2<CAP2P>
extern volatile __bit                   CAP2P               __at(0x44AB);	// @ (0x895 * 8 + 3)
#define                                 CAP2P_bit           _BIT_ACCESS(AT1CCON2,3)
// AT1CCON3<CAP3P>
extern volatile __bit                   CAP3P               __at(0x44CB);	// @ (0x899 * 8 + 3)
#define                                 CAP3P_bit           _BIT_ACCESS(AT1CCON3,3)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// AT1CC1L<CC10>
extern volatile __bit                   CC10                __at(0x4478);	// @ (0x88F * 8 + 0)
#define                                 CC10_bit            _BIT_ACCESS(AT1CC1L,0)
// AT1CC1L<CC11>
extern volatile __bit                   CC11                __at(0x4479);	// @ (0x88F * 8 + 1)
#define                                 CC11_bit            _BIT_ACCESS(AT1CC1L,1)
// AT1CC1L<CC12>
extern volatile __bit                   CC12                __at(0x447A);	// @ (0x88F * 8 + 2)
#define                                 CC12_bit            _BIT_ACCESS(AT1CC1L,2)
// AT1CC1L<CC14>
extern volatile __bit                   CC14                __at(0x447C);	// @ (0x88F * 8 + 4)
#define                                 CC14_bit            _BIT_ACCESS(AT1CC1L,4)
// AT1CC1L<CC15>
extern volatile __bit                   CC15                __at(0x447D);	// @ (0x88F * 8 + 5)
#define                                 CC15_bit            _BIT_ACCESS(AT1CC1L,5)
// AT1CC1L<CC16>
extern volatile __bit                   CC16                __at(0x447E);	// @ (0x88F * 8 + 6)
#define                                 CC16_bit            _BIT_ACCESS(AT1CC1L,6)
// AT1CC1L<CC17>
extern volatile __bit                   CC17                __at(0x447F);	// @ (0x88F * 8 + 7)
#define                                 CC17_bit            _BIT_ACCESS(AT1CC1L,7)
// AT1CC1H<CC18>
extern volatile __bit                   CC18                __at(0x4480);	// @ (0x890 * 8 + 0)
#define                                 CC18_bit            _BIT_ACCESS(AT1CC1H,0)
// AT1CC1H<CC19>
extern volatile __bit                   CC19                __at(0x4481);	// @ (0x890 * 8 + 1)
#define                                 CC19_bit            _BIT_ACCESS(AT1CC1H,1)
// AT1CCON1<CC1EN>
extern volatile __bit                   CC1EN               __at(0x448F);	// @ (0x891 * 8 + 7)
#define                                 CC1EN_bit           _BIT_ACCESS(AT1CCON1,7)
// AT1CCON1<CC1MODE>
extern volatile __bit                   CC1MODE             __at(0x4488);	// @ (0x891 * 8 + 0)
#define                                 CC1MODE_bit         _BIT_ACCESS(AT1CCON1,0)
// AT1CCON1<CC1POL>
extern volatile __bit                   CC1POL              __at(0x448C);	// @ (0x891 * 8 + 4)
#define                                 CC1POL_bit          _BIT_ACCESS(AT1CCON1,4)
// AT1CC2L<CC20>
extern volatile __bit                   CC20                __at(0x4498);	// @ (0x893 * 8 + 0)
#define                                 CC20_bit            _BIT_ACCESS(AT1CC2L,0)
// AT1CC2L<CC21>
extern volatile __bit                   CC21                __at(0x4499);	// @ (0x893 * 8 + 1)
#define                                 CC21_bit            _BIT_ACCESS(AT1CC2L,1)
// AT1CC2L<CC22>
extern volatile __bit                   CC22                __at(0x449A);	// @ (0x893 * 8 + 2)
#define                                 CC22_bit            _BIT_ACCESS(AT1CC2L,2)
// AT1CC2L<CC24>
extern volatile __bit                   CC24                __at(0x449C);	// @ (0x893 * 8 + 4)
#define                                 CC24_bit            _BIT_ACCESS(AT1CC2L,4)
// AT1CC2L<CC26>
extern volatile __bit                   CC26                __at(0x449E);	// @ (0x893 * 8 + 6)
#define                                 CC26_bit            _BIT_ACCESS(AT1CC2L,6)
// AT1CC2L<CC27>
extern volatile __bit                   CC27                __at(0x449F);	// @ (0x893 * 8 + 7)
#define                                 CC27_bit            _BIT_ACCESS(AT1CC2L,7)
// AT1CC2H<CC28>
extern volatile __bit                   CC28                __at(0x44A0);	// @ (0x894 * 8 + 0)
#define                                 CC28_bit            _BIT_ACCESS(AT1CC2H,0)
// AT1CC2H<CC29>
extern volatile __bit                   CC29                __at(0x44A1);	// @ (0x894 * 8 + 1)
#define                                 CC29_bit            _BIT_ACCESS(AT1CC2H,1)
// AT1CCON2<CC2EN>
extern volatile __bit                   CC2EN               __at(0x44AF);	// @ (0x895 * 8 + 7)
#define                                 CC2EN_bit           _BIT_ACCESS(AT1CCON2,7)
// AT1CCON2<CC2MODE>
extern volatile __bit                   CC2MODE             __at(0x44A8);	// @ (0x895 * 8 + 0)
#define                                 CC2MODE_bit         _BIT_ACCESS(AT1CCON2,0)
// AT1CCON2<CC2POL>
extern volatile __bit                   CC2POL              __at(0x44AC);	// @ (0x895 * 8 + 4)
#define                                 CC2POL_bit          _BIT_ACCESS(AT1CCON2,4)
// AT1CC3L<CC30>
extern volatile __bit                   CC30                __at(0x44B8);	// @ (0x897 * 8 + 0)
#define                                 CC30_bit            _BIT_ACCESS(AT1CC3L,0)
// AT1CC3L<CC31>
extern volatile __bit                   CC31                __at(0x44B9);	// @ (0x897 * 8 + 1)
#define                                 CC31_bit            _BIT_ACCESS(AT1CC3L,1)
// AT1CC3L<CC32>
extern volatile __bit                   CC32                __at(0x44BA);	// @ (0x897 * 8 + 2)
#define                                 CC32_bit            _BIT_ACCESS(AT1CC3L,2)
// AT1CC3L<CC33>
extern volatile __bit                   CC33                __at(0x44BB);	// @ (0x897 * 8 + 3)
#define                                 CC33_bit            _BIT_ACCESS(AT1CC3L,3)
// AT1CC3L<CC34>
extern volatile __bit                   CC34                __at(0x44BC);	// @ (0x897 * 8 + 4)
#define                                 CC34_bit            _BIT_ACCESS(AT1CC3L,4)
// AT1CC3L<CC35>
extern volatile __bit                   CC35                __at(0x44BD);	// @ (0x897 * 8 + 5)
#define                                 CC35_bit            _BIT_ACCESS(AT1CC3L,5)
// AT1CC3L<CC36>
extern volatile __bit                   CC36                __at(0x44BE);	// @ (0x897 * 8 + 6)
#define                                 CC36_bit            _BIT_ACCESS(AT1CC3L,6)
// AT1CC3L<CC37>
extern volatile __bit                   CC37                __at(0x44BF);	// @ (0x897 * 8 + 7)
#define                                 CC37_bit            _BIT_ACCESS(AT1CC3L,7)
// AT1CC3H<CC38>
extern volatile __bit                   CC38                __at(0x44C0);	// @ (0x898 * 8 + 0)
#define                                 CC38_bit            _BIT_ACCESS(AT1CC3H,0)
// AT1CC3H<CC39>
extern volatile __bit                   CC39                __at(0x44C1);	// @ (0x898 * 8 + 1)
#define                                 CC39_bit            _BIT_ACCESS(AT1CC3H,1)
// AT1CCON3<CC3EN>
extern volatile __bit                   CC3EN               __at(0x44CF);	// @ (0x899 * 8 + 7)
#define                                 CC3EN_bit           _BIT_ACCESS(AT1CCON3,7)
// AT1CCON3<CC3MODE>
extern volatile __bit                   CC3MODE             __at(0x44C8);	// @ (0x899 * 8 + 0)
#define                                 CC3MODE_bit         _BIT_ACCESS(AT1CCON3,0)
// AT1CCON3<CC3POL>
extern volatile __bit                   CC3POL              __at(0x44CC);	// @ (0x899 * 8 + 4)
#define                                 CC3POL_bit          _BIT_ACCESS(AT1CCON3,4)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x14A0);	// @ (0x294 * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x14A1);	// @ (0x294 * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0x14A2);	// @ (0x294 * 8 + 2)
#define                                 CCP1CTS2_bit        _BIT_ACCESS(CCP1CAP,2)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x149F);	// @ (0x293 * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x149C);	// @ (0x293 * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x482);	// @ (0x90 * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x82);	// @ (0x10 * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1498);	// @ (0x293 * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1499);	// @ (0x293 * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x149A);	// @ (0x293 * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x149B);	// @ (0x293 * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x149D);	// @ (0x293 * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP1PPS<CCP1PPS0>
extern volatile __bit                   CCP1PPS0            __at(0x70A0);	// @ (0xE14 * 8 + 0)
#define                                 CCP1PPS0_bit        _BIT_ACCESS(CCP1PPS,0)
// CCP1PPS<CCP1PPS1>
extern volatile __bit                   CCP1PPS1            __at(0x70A1);	// @ (0xE14 * 8 + 1)
#define                                 CCP1PPS1_bit        _BIT_ACCESS(CCP1PPS,1)
// CCP1PPS<CCP1PPS2>
extern volatile __bit                   CCP1PPS2            __at(0x70A2);	// @ (0xE14 * 8 + 2)
#define                                 CCP1PPS2_bit        _BIT_ACCESS(CCP1PPS,2)
// CCP1PPS<CCP1PPS3>
extern volatile __bit                   CCP1PPS3            __at(0x70A3);	// @ (0xE14 * 8 + 3)
#define                                 CCP1PPS3_bit        _BIT_ACCESS(CCP1PPS,3)
// CCP1PPS<CCP1PPS4>
extern volatile __bit                   CCP1PPS4            __at(0x70A4);	// @ (0xE14 * 8 + 4)
#define                                 CCP1PPS4_bit        _BIT_ACCESS(CCP1PPS,4)
// CCPTMRS<CCP1TSEL0>
extern volatile __bit                   CCP1TSEL0           __at(0x14F0);	// @ (0x29E * 8 + 0)
#define                                 CCP1TSEL0_bit       _BIT_ACCESS(CCPTMRS,0)
// CCPTMRS<CCP1TSEL1>
extern volatile __bit                   CCP1TSEL1           __at(0x14F1);	// @ (0x29E * 8 + 1)
#define                                 CCP1TSEL1_bit       _BIT_ACCESS(CCPTMRS,1)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x14D8);	// @ (0x29B * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x14D9);	// @ (0x29B * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CAP<CCP2CTS2>
extern volatile __bit                   CCP2CTS2            __at(0x14DA);	// @ (0x29B * 8 + 2)
#define                                 CCP2CTS2_bit        _BIT_ACCESS(CCP2CAP,2)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x14D7);	// @ (0x29A * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x14D4);	// @ (0x29A * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x488);	// @ (0x91 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x88);	// @ (0x11 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x14D0);	// @ (0x29A * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
