MikroElektronika/core_packages/PIC/XC8/def/PIC16F1615/mcu.h
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x74);	// @ (0xE * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// RC4PPS<RC4PPS0>
extern volatile __bit                   RC4PPS0             __at(0x7520);	// @ (0xEA4 * 8 + 0)
#define                                 RC4PPS0_bit         _BIT_ACCESS(RC4PPS,0)
// RC4PPS<RC4PPS1>
extern volatile __bit                   RC4PPS1             __at(0x7521);	// @ (0xEA4 * 8 + 1)
#define                                 RC4PPS1_bit         _BIT_ACCESS(RC4PPS,1)
// RC4PPS<RC4PPS2>
extern volatile __bit                   RC4PPS2             __at(0x7522);	// @ (0xEA4 * 8 + 2)
#define                                 RC4PPS2_bit         _BIT_ACCESS(RC4PPS,2)
// RC4PPS<RC4PPS3>
extern volatile __bit                   RC4PPS3             __at(0x7523);	// @ (0xEA4 * 8 + 3)
#define                                 RC4PPS3_bit         _BIT_ACCESS(RC4PPS,3)
// RC4PPS<RC4PPS4>
extern volatile __bit                   RC4PPS4             __at(0x7524);	// @ (0xEA4 * 8 + 4)
#define                                 RC4PPS4_bit         _BIT_ACCESS(RC4PPS,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x75);	// @ (0xE * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// RC5PPS<RC5PPS0>
extern volatile __bit                   RC5PPS0             __at(0x7528);	// @ (0xEA5 * 8 + 0)
#define                                 RC5PPS0_bit         _BIT_ACCESS(RC5PPS,0)
// RC5PPS<RC5PPS1>
extern volatile __bit                   RC5PPS1             __at(0x7529);	// @ (0xEA5 * 8 + 1)
#define                                 RC5PPS1_bit         _BIT_ACCESS(RC5PPS,1)
// RC5PPS<RC5PPS2>
extern volatile __bit                   RC5PPS2             __at(0x752A);	// @ (0xEA5 * 8 + 2)
#define                                 RC5PPS2_bit         _BIT_ACCESS(RC5PPS,2)
// RC5PPS<RC5PPS3>
extern volatile __bit                   RC5PPS3             __at(0x752B);	// @ (0xEA5 * 8 + 3)
#define                                 RC5PPS3_bit         _BIT_ACCESS(RC5PPS,3)
// RC5PPS<RC5PPS4>
extern volatile __bit                   RC5PPS4             __at(0x752C);	// @ (0xEA5 * 8 + 4)
#define                                 RC5PPS4_bit         _BIT_ACCESS(RC5PPS,4)
// SSP1CON2<RCEN>
extern volatile __bit                   RCEN                __at(0x10B3);	// @ (0x216 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSP1CON2,3)
// BAUD1CON<RCIDL>
extern volatile __bit                   RCIDL               __at(0xCFE);	// @ (0x19F * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUD1CON,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x485);	// @ (0x90 * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x85);	// @ (0x10 * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// PMCON1<RD>
extern volatile __bit                   RD                  __at(0xCA8);	// @ (0x195 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(PMCON1,0)
// CWG1AS0<REN>
extern volatile __bit                   REN                 __at(0x349E);	// @ (0x693 * 8 + 6)
#define                                 REN_bit             _BIT_ACCESS(CWG1AS0,6)
// AT1RESL<RES0>
extern volatile __bit                   RES0                __at(0x4060);	// @ (0x80C * 8 + 0)
#define                                 RES0_bit            _BIT_ACCESS(AT1RESL,0)
// AT1RESL<RES1>
extern volatile __bit                   RES1                __at(0x4061);	// @ (0x80C * 8 + 1)
#define                                 RES1_bit            _BIT_ACCESS(AT1RESL,1)
// AT1RESL<RES2>
extern volatile __bit                   RES2                __at(0x4062);	// @ (0x80C * 8 + 2)
#define                                 RES2_bit            _BIT_ACCESS(AT1RESL,2)
// AT1RESL<RES3>
extern volatile __bit                   RES3                __at(0x4063);	// @ (0x80C * 8 + 3)
#define                                 RES3_bit            _BIT_ACCESS(AT1RESL,3)
// AT1RESL<RES4>
extern volatile __bit                   RES4                __at(0x4064);	// @ (0x80C * 8 + 4)
#define                                 RES4_bit            _BIT_ACCESS(AT1RESL,4)
// AT1RESL<RES5>
extern volatile __bit                   RES5                __at(0x4065);	// @ (0x80C * 8 + 5)
#define                                 RES5_bit            _BIT_ACCESS(AT1RESL,5)
// AT1RESL<RES6>
extern volatile __bit                   RES6                __at(0x4066);	// @ (0x80C * 8 + 6)
#define                                 RES6_bit            _BIT_ACCESS(AT1RESL,6)
// AT1RESL<RES7>
extern volatile __bit                   RES7                __at(0x4067);	// @ (0x80C * 8 + 7)
#define                                 RES7_bit            _BIT_ACCESS(AT1RESL,7)
// AT1RESH<RES8>
extern volatile __bit                   RES8                __at(0x4068);	// @ (0x80D * 8 + 0)
#define                                 RES8_bit            _BIT_ACCESS(AT1RESH,0)
// AT1RESH<RES9>
extern volatile __bit                   RES9                __at(0x4069);	// @ (0x80D * 8 + 1)
#define                                 RES9_bit            _BIT_ACCESS(AT1RESH,1)
// SSP1CON2<RSEN>
extern volatile __bit                   RSEN                __at(0x10B1);	// @ (0x216 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// RC1STA<RX9>
extern volatile __bit                   RX9                 __at(0xCEE);	// @ (0x19D * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RC1STA,6)
// RC1STA<RX9D>
extern volatile __bit                   RX9D                __at(0xCE8);	// @ (0x19D * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RC1STA,0)
// RXPPS<RXPPS0>
extern volatile __bit                   RXPPS0              __at(0x7120);	// @ (0xE24 * 8 + 0)
#define                                 RXPPS0_bit          _BIT_ACCESS(RXPPS,0)
// RXPPS<RXPPS1>
extern volatile __bit                   RXPPS1              __at(0x7121);	// @ (0xE24 * 8 + 1)
#define                                 RXPPS1_bit          _BIT_ACCESS(RXPPS,1)
// RXPPS<RXPPS2>
extern volatile __bit                   RXPPS2              __at(0x7122);	// @ (0xE24 * 8 + 2)
#define                                 RXPPS2_bit          _BIT_ACCESS(RXPPS,2)
// RXPPS<RXPPS3>
extern volatile __bit                   RXPPS3              __at(0x7123);	// @ (0xE24 * 8 + 3)
#define                                 RXPPS3_bit          _BIT_ACCESS(RXPPS,3)
// RXPPS<RXPPS4>
extern volatile __bit                   RXPPS4              __at(0x7124);	// @ (0xE24 * 8 + 4)
#define                                 RXPPS4_bit          _BIT_ACCESS(RXPPS,4)
// SSP1STAT<R_nW>
extern volatile __bit                   R_nW                __at(0x10A2);	// @ (0x214 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1CON3<SBCDE>
extern volatile __bit                   SBCDE               __at(0x10BA);	// @ (0x217 * 8 + 2)
#define                                 SBCDE_bit           _BIT_ACCESS(SSP1CON3,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x8B7);	// @ (0x116 * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SCANCON0<SCANBUSY>
extern volatile __bit                   SCANBUSY            __at(0x38E5);	// @ (0x71C * 8 + 5)
#define                                 SCANBUSY_bit        _BIT_ACCESS(SCANCON0,5)
// SCANCON0<SCANEN>
extern volatile __bit                   SCANEN              __at(0x38E7);	// @ (0x71C * 8 + 7)
#define                                 SCANEN_bit          _BIT_ACCESS(SCANCON0,7)
// SCANCON0<SCANGO>
extern volatile __bit                   SCANGO              __at(0x38E6);	// @ (0x71C * 8 + 6)
#define                                 SCANGO_bit          _BIT_ACCESS(SCANCON0,6)
// SCANHADRL<SCANHADR0>
extern volatile __bit                   SCANHADR0           __at(0x38D0);	// @ (0x71A * 8 + 0)
#define                                 SCANHADR0_bit       _BIT_ACCESS(SCANHADRL,0)
// SCANHADRL<SCANHADR1>
extern volatile __bit                   SCANHADR1           __at(0x38D1);	// @ (0x71A * 8 + 1)
#define                                 SCANHADR1_bit       _BIT_ACCESS(SCANHADRL,1)
// SCANHADRH<SCANHADR10>
extern volatile __bit                   SCANHADR10          __at(0x38DA);	// @ (0x71B * 8 + 2)
#define                                 SCANHADR10_bit      _BIT_ACCESS(SCANHADRH,2)
// SCANHADRH<SCANHADR11>
extern volatile __bit                   SCANHADR11          __at(0x38DB);	// @ (0x71B * 8 + 3)
#define                                 SCANHADR11_bit      _BIT_ACCESS(SCANHADRH,3)
// SCANHADRH<SCANHADR12>
extern volatile __bit                   SCANHADR12          __at(0x38DC);	// @ (0x71B * 8 + 4)
#define                                 SCANHADR12_bit      _BIT_ACCESS(SCANHADRH,4)
// SCANHADRH<SCANHADR13>
extern volatile __bit                   SCANHADR13          __at(0x38DD);	// @ (0x71B * 8 + 5)
#define                                 SCANHADR13_bit      _BIT_ACCESS(SCANHADRH,5)
// SCANHADRH<SCANHADR14>
extern volatile __bit                   SCANHADR14          __at(0x38DE);	// @ (0x71B * 8 + 6)
#define                                 SCANHADR14_bit      _BIT_ACCESS(SCANHADRH,6)
// SCANHADRH<SCANHADR15>
extern volatile __bit                   SCANHADR15          __at(0x38DF);	// @ (0x71B * 8 + 7)
#define                                 SCANHADR15_bit      _BIT_ACCESS(SCANHADRH,7)
// SCANHADRL<SCANHADR2>
extern volatile __bit                   SCANHADR2           __at(0x38D2);	// @ (0x71A * 8 + 2)
#define                                 SCANHADR2_bit       _BIT_ACCESS(SCANHADRL,2)
// SCANHADRL<SCANHADR3>
extern volatile __bit                   SCANHADR3           __at(0x38D3);	// @ (0x71A * 8 + 3)
#define                                 SCANHADR3_bit       _BIT_ACCESS(SCANHADRL,3)
// SCANHADRL<SCANHADR4>
extern volatile __bit                   SCANHADR4           __at(0x38D4);	// @ (0x71A * 8 + 4)
#define                                 SCANHADR4_bit       _BIT_ACCESS(SCANHADRL,4)
// SCANHADRL<SCANHADR5>
extern volatile __bit                   SCANHADR5           __at(0x38D5);	// @ (0x71A * 8 + 5)
#define                                 SCANHADR5_bit       _BIT_ACCESS(SCANHADRL,5)
// SCANHADRL<SCANHADR6>
extern volatile __bit                   SCANHADR6           __at(0x38D6);	// @ (0x71A * 8 + 6)
#define                                 SCANHADR6_bit       _BIT_ACCESS(SCANHADRL,6)
// SCANHADRL<SCANHADR7>
extern volatile __bit                   SCANHADR7           __at(0x38D7);	// @ (0x71A * 8 + 7)
#define                                 SCANHADR7_bit       _BIT_ACCESS(SCANHADRL,7)
// SCANHADRH<SCANHADR8>
extern volatile __bit                   SCANHADR8           __at(0x38D8);	// @ (0x71B * 8 + 0)
#define                                 SCANHADR8_bit       _BIT_ACCESS(SCANHADRH,0)
// SCANHADRH<SCANHADR9>
extern volatile __bit                   SCANHADR9           __at(0x38D9);	// @ (0x71B * 8 + 1)
#define                                 SCANHADR9_bit       _BIT_ACCESS(SCANHADRH,1)
// PIE4<SCANIE>
extern volatile __bit                   SCANIE              __at(0x49F);	// @ (0x93 * 8 + 7)
#define                                 SCANIE_bit          _BIT_ACCESS(PIE4,7)
// PIR4<SCANIF>
extern volatile __bit                   SCANIF              __at(0x9F);	// @ (0x13 * 8 + 7)
#define                                 SCANIF_bit          _BIT_ACCESS(PIR4,7)
// SCANCON0<SCANINTM>
extern volatile __bit                   SCANINTM            __at(0x38E3);	// @ (0x71C * 8 + 3)
#define                                 SCANINTM_bit        _BIT_ACCESS(SCANCON0,3)
// SCANCON0<SCANINVALID>
extern volatile __bit                   SCANINVALID         __at(0x38E4);	// @ (0x71C * 8 + 4)
#define                                 SCANINVALID_bit     _BIT_ACCESS(SCANCON0,4)
// SCANLADRL<SCANLADR0>
extern volatile __bit                   SCANLADR0           __at(0x38C0);	// @ (0x718 * 8 + 0)
#define                                 SCANLADR0_bit       _BIT_ACCESS(SCANLADRL,0)
// SCANLADRL<SCANLADR1>
extern volatile __bit                   SCANLADR1           __at(0x38C1);	// @ (0x718 * 8 + 1)
#define                                 SCANLADR1_bit       _BIT_ACCESS(SCANLADRL,1)
// SCANLADRH<SCANLADR10>
extern volatile __bit                   SCANLADR10          __at(0x38CA);	// @ (0x719 * 8 + 2)
#define                                 SCANLADR10_bit      _BIT_ACCESS(SCANLADRH,2)
// SCANLADRH<SCANLADR11>
extern volatile __bit                   SCANLADR11          __at(0x38CB);	// @ (0x719 * 8 + 3)
#define                                 SCANLADR11_bit      _BIT_ACCESS(SCANLADRH,3)
// SCANLADRH<SCANLADR12>
extern volatile __bit                   SCANLADR12          __at(0x38CC);	// @ (0x719 * 8 + 4)
#define                                 SCANLADR12_bit      _BIT_ACCESS(SCANLADRH,4)
// SCANLADRH<SCANLADR13>
extern volatile __bit                   SCANLADR13          __at(0x38CD);	// @ (0x719 * 8 + 5)
#define                                 SCANLADR13_bit      _BIT_ACCESS(SCANLADRH,5)
// SCANLADRH<SCANLADR14>
extern volatile __bit                   SCANLADR14          __at(0x38CE);	// @ (0x719 * 8 + 6)
#define                                 SCANLADR14_bit      _BIT_ACCESS(SCANLADRH,6)
// SCANLADRH<SCANLADR15>
extern volatile __bit                   SCANLADR15          __at(0x38CF);	// @ (0x719 * 8 + 7)
#define                                 SCANLADR15_bit      _BIT_ACCESS(SCANLADRH,7)
// SCANLADRL<SCANLADR2>
extern volatile __bit                   SCANLADR2           __at(0x38C2);	// @ (0x718 * 8 + 2)
#define                                 SCANLADR2_bit       _BIT_ACCESS(SCANLADRL,2)
// SCANLADRL<SCANLADR3>
extern volatile __bit                   SCANLADR3           __at(0x38C3);	// @ (0x718 * 8 + 3)
#define                                 SCANLADR3_bit       _BIT_ACCESS(SCANLADRL,3)
// SCANLADRL<SCANLADR4>
extern volatile __bit                   SCANLADR4           __at(0x38C4);	// @ (0x718 * 8 + 4)
#define                                 SCANLADR4_bit       _BIT_ACCESS(SCANLADRL,4)
// SCANLADRL<SCANLADR5>
extern volatile __bit                   SCANLADR5           __at(0x38C5);	// @ (0x718 * 8 + 5)
#define                                 SCANLADR5_bit       _BIT_ACCESS(SCANLADRL,5)
// SCANLADRL<SCANLADR6>
extern volatile __bit                   SCANLADR6           __at(0x38C6);	// @ (0x718 * 8 + 6)
#define                                 SCANLADR6_bit       _BIT_ACCESS(SCANLADRL,6)
// SCANLADRL<SCANLADR7>
extern volatile __bit                   SCANLADR7           __at(0x38C7);	// @ (0x718 * 8 + 7)
#define                                 SCANLADR7_bit       _BIT_ACCESS(SCANLADRL,7)
// SCANLADRH<SCANLADR8>
extern volatile __bit                   SCANLADR8           __at(0x38C8);	// @ (0x719 * 8 + 0)
#define                                 SCANLADR8_bit       _BIT_ACCESS(SCANLADRH,0)
// SCANLADRH<SCANLADR9>
extern volatile __bit                   SCANLADR9           __at(0x38C9);	// @ (0x719 * 8 + 1)
#define                                 SCANLADR9_bit       _BIT_ACCESS(SCANLADRH,1)
// SCANCON0<SCANMODE0>
extern volatile __bit                   SCANMODE0           __at(0x38E0);	// @ (0x71C * 8 + 0)
#define                                 SCANMODE0_bit       _BIT_ACCESS(SCANCON0,0)
// SCANCON0<SCANMODE1>
extern volatile __bit                   SCANMODE1           __at(0x38E1);	// @ (0x71C * 8 + 1)
#define                                 SCANMODE1_bit       _BIT_ACCESS(SCANCON0,1)
// SCANTRIG<SCANTSEL0>
extern volatile __bit                   SCANTSEL0           __at(0x38E8);	// @ (0x71D * 8 + 0)
#define                                 SCANTSEL0_bit       _BIT_ACCESS(SCANTRIG,0)
// SCANTRIG<SCANTSEL1>
extern volatile __bit                   SCANTSEL1           __at(0x38E9);	// @ (0x71D * 8 + 1)
#define                                 SCANTSEL1_bit       _BIT_ACCESS(SCANTRIG,1)
// SCANTRIG<SCANTSEL2>
extern volatile __bit                   SCANTSEL2           __at(0x38EA);	// @ (0x71D * 8 + 2)
#define                                 SCANTSEL2_bit       _BIT_ACCESS(SCANTRIG,2)
// SCANTRIG<SCANTSEL3>
extern volatile __bit                   SCANTSEL3           __at(0x38EB);	// @ (0x71D * 8 + 3)
#define                                 SCANTSEL3_bit       _BIT_ACCESS(SCANTRIG,3)
// SSP1CON3<SCIE>
extern volatile __bit                   SCIE                __at(0x10BD);	// @ (0x217 * 8 + 5)
#define                                 SCIE_bit            _BIT_ACCESS(SSP1CON3,5)
// BAUD1CON<SCKP>
extern volatile __bit                   SCKP                __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUD1CON,4)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x4C8);	// @ (0x99 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x4C9);	// @ (0x99 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// SSP1CON3<SDAHT>
extern volatile __bit                   SDAHT               __at(0x10BB);	// @ (0x217 * 8 + 3)
#define                                 SDAHT_bit           _BIT_ACCESS(SSP1CON3,3)
// TX1STA<SENDB>
extern volatile __bit                   SENDB               __at(0xCF3);	// @ (0x19E * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TX1STA,3)
// PID1SETL<SET0>
extern volatile __bit                   SET0                __at(0x2C60);	// @ (0x58C * 8 + 0)
#define                                 SET0_bit            _BIT_ACCESS(PID1SETL,0)
// PID1SETL<SET1>
extern volatile __bit                   SET1                __at(0x2C61);	// @ (0x58C * 8 + 1)
#define                                 SET1_bit            _BIT_ACCESS(PID1SETL,1)
// PID1SETH<SET10>
extern volatile __bit                   SET10               __at(0x2C6A);	// @ (0x58D * 8 + 2)
#define                                 SET10_bit           _BIT_ACCESS(PID1SETH,2)
// PID1SETH<SET11>
extern volatile __bit                   SET11               __at(0x2C6B);	// @ (0x58D * 8 + 3)
#define                                 SET11_bit           _BIT_ACCESS(PID1SETH,3)
// PID1SETH<SET12>
extern volatile __bit                   SET12               __at(0x2C6C);	// @ (0x58D * 8 + 4)
#define                                 SET12_bit           _BIT_ACCESS(PID1SETH,4)
// PID1SETH<SET13>
extern volatile __bit                   SET13               __at(0x2C6D);	// @ (0x58D * 8 + 5)
#define                                 SET13_bit           _BIT_ACCESS(PID1SETH,5)
// PID1SETH<SET14>
extern volatile __bit                   SET14               __at(0x2C6E);	// @ (0x58D * 8 + 6)
#define                                 SET14_bit           _BIT_ACCESS(PID1SETH,6)
// PID1SETH<SET15>
extern volatile __bit                   SET15               __at(0x2C6F);	// @ (0x58D * 8 + 7)
#define                                 SET15_bit           _BIT_ACCESS(PID1SETH,7)
// PID1SETL<SET2>
extern volatile __bit                   SET2                __at(0x2C62);	// @ (0x58C * 8 + 2)
#define                                 SET2_bit            _BIT_ACCESS(PID1SETL,2)
// PID1SETL<SET3>
extern volatile __bit                   SET3                __at(0x2C63);	// @ (0x58C * 8 + 3)
#define                                 SET3_bit            _BIT_ACCESS(PID1SETL,3)
// PID1SETL<SET4>
extern volatile __bit                   SET4                __at(0x2C64);	// @ (0x58C * 8 + 4)
#define                                 SET4_bit            _BIT_ACCESS(PID1SETL,4)
// PID1SETL<SET5>
extern volatile __bit                   SET5                __at(0x2C65);	// @ (0x58C * 8 + 5)
#define                                 SET5_bit            _BIT_ACCESS(PID1SETL,5)
// PID1SETL<SET6>
extern volatile __bit                   SET6                __at(0x2C66);	// @ (0x58C * 8 + 6)
#define                                 SET6_bit            _BIT_ACCESS(PID1SETL,6)
// PID1SETL<SET7>
extern volatile __bit                   SET7                __at(0x2C67);	// @ (0x58C * 8 + 7)
#define                                 SET7_bit            _BIT_ACCESS(PID1SETL,7)
// PID1SETH<SET8>
extern volatile __bit                   SET8                __at(0x2C68);	// @ (0x58D * 8 + 0)
#define                                 SET8_bit            _BIT_ACCESS(PID1SETH,0)
// PID1SETH<SET9>
extern volatile __bit                   SET9                __at(0x2C69);	// @ (0x58D * 8 + 1)
#define                                 SET9_bit            _BIT_ACCESS(PID1SETH,1)
// CRCSHIFTL<SHIFT0>
extern volatile __bit                   SHIFT0              __at(0x3CA8);	// @ (0x795 * 8 + 0)
#define                                 SHIFT0_bit          _BIT_ACCESS(CRCSHIFTL,0)
// CRCSHIFTL<SHIFT1>
extern volatile __bit                   SHIFT1              __at(0x3CA9);	// @ (0x795 * 8 + 1)
#define                                 SHIFT1_bit          _BIT_ACCESS(CRCSHIFTL,1)
// CRCSHIFTH<SHIFT10>
extern volatile __bit                   SHIFT10             __at(0x3CB2);	// @ (0x796 * 8 + 2)
#define                                 SHIFT10_bit         _BIT_ACCESS(CRCSHIFTH,2)
// CRCSHIFTH<SHIFT11>
extern volatile __bit                   SHIFT11             __at(0x3CB3);	// @ (0x796 * 8 + 3)
#define                                 SHIFT11_bit         _BIT_ACCESS(CRCSHIFTH,3)
// CRCSHIFTH<SHIFT12>
extern volatile __bit                   SHIFT12             __at(0x3CB4);	// @ (0x796 * 8 + 4)
#define                                 SHIFT12_bit         _BIT_ACCESS(CRCSHIFTH,4)
// CRCSHIFTH<SHIFT13>
extern volatile __bit                   SHIFT13             __at(0x3CB5);	// @ (0x796 * 8 + 5)
#define                                 SHIFT13_bit         _BIT_ACCESS(CRCSHIFTH,5)
// CRCSHIFTH<SHIFT14>
extern volatile __bit                   SHIFT14             __at(0x3CB6);	// @ (0x796 * 8 + 6)
#define                                 SHIFT14_bit         _BIT_ACCESS(CRCSHIFTH,6)
// CRCSHIFTH<SHIFT15>
extern volatile __bit                   SHIFT15             __at(0x3CB7);	// @ (0x796 * 8 + 7)
#define                                 SHIFT15_bit         _BIT_ACCESS(CRCSHIFTH,7)
// CRCSHIFTL<SHIFT2>
extern volatile __bit                   SHIFT2              __at(0x3CAA);	// @ (0x795 * 8 + 2)
#define                                 SHIFT2_bit          _BIT_ACCESS(CRCSHIFTL,2)
// CRCSHIFTL<SHIFT3>
extern volatile __bit                   SHIFT3              __at(0x3CAB);	// @ (0x795 * 8 + 3)
#define                                 SHIFT3_bit          _BIT_ACCESS(CRCSHIFTL,3)
// CRCSHIFTL<SHIFT4>
extern volatile __bit                   SHIFT4              __at(0x3CAC);	// @ (0x795 * 8 + 4)
#define                                 SHIFT4_bit          _BIT_ACCESS(CRCSHIFTL,4)
// CRCSHIFTL<SHIFT5>
extern volatile __bit                   SHIFT5              __at(0x3CAD);	// @ (0x795 * 8 + 5)
#define                                 SHIFT5_bit          _BIT_ACCESS(CRCSHIFTL,5)
// CRCSHIFTL<SHIFT6>
extern volatile __bit                   SHIFT6              __at(0x3CAE);	// @ (0x795 * 8 + 6)
#define                                 SHIFT6_bit          _BIT_ACCESS(CRCSHIFTL,6)
// CRCSHIFTL<SHIFT7>
extern volatile __bit                   SHIFT7              __at(0x3CAF);	// @ (0x795 * 8 + 7)
#define                                 SHIFT7_bit          _BIT_ACCESS(CRCSHIFTL,7)
// CRCSHIFTH<SHIFT8>
extern volatile __bit                   SHIFT8              __at(0x3CB0);	// @ (0x796 * 8 + 0)
